[
    { "url": "https://www.engr.ucr.edu/", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentMarlan and Rosemary Bourns College of EngineeringBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringSearchUC Riverside Marlan and Rosemary Bourns College of Engineering Celebrating 30 YearsSearchStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership Departments and ProgramsBioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMasters in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership BioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMasters in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in Engineering            Calling all 2021 graduates!                We want to hear about your next destination. Share your story to help future cohorts get a glimpse of “what’s next” after graduation.Share Story            Transfer Student Experiences    Learn more            Graduate Students in Charge    Learn more about our graduate programs            The Bourns College of Engineering    Find out how you can givePreviousNextBreadcrumbNews03 Jun      A new water treatment technology could also help Mars explorers          A catalyst that destroys perchlorate in water could clean Martian soil     Read More »aboutA new water treatment technology could also help Mars explorers02 Jun      Poor air quality and warehouses linked to Inland Empire Covid-19 inequities          UC Riverside professors call for intersectional approach to Covid-19 exposure interventions    Read More »aboutPoor air quality and warehouses linked to Inland Empire Covid-19 inequities26 May      $79,000 raised for Professor Emeritus Tom Payne’s 79th birthday          The Thomas H. Payne Scholarship in Computer Science, which supports undergraduate students in computer science, has grown to $79,079, just in time for Professor Paynes 79th birthday.    Read More »about$79,000 raised for Professor Emeritus Tom Payne’s 79th birthday25 May      UC Riverside offers UC systems first masters degree in robotics          Algorithmic bias is one problem the program will tackle    Read More »aboutUC Riverside offers UC systems first masters degree in robotics24 May      Tiny tomatoes could mean big profits for urban agriculture          Grants support continued development of tomatoes for vertical farming    Read More »aboutTiny tomatoes could mean big profits for urban agriculture21 May      Implantable piezoelectric polymer improves controlled release of drugs          Repeated tests showed a similar amount of drug release per activation, confirming robust control of release rate    Read More »aboutImplantable piezoelectric polymer improves controlled release of drugs21 May      Bourns Science and Engineering Day expands STEM outreach to include school districts in Orange County and Los Angeles County          Each year, the Society of Women Engineers SWE, one of the Marlan and Rosemary Bourns College of Engineering’s BCOE more than 20 professional student organizations, hosts Bourns Science and Engineering Day BSED, formerly called Bourns Engineering Day, a community outreach event introducing STEM to local K-12 students through activities, speakers and lessons. Despite this year’s event moving completely online for the first time, due to the remote setting, many more schools were able to attend in addition to typical attendees from Riverside Unified School District. Students and teachers    Read More »aboutBourns Science and Engineering Day expands STEM outreach to include school districts in Orange County and Los Angeles County18 May      UCR computer scientist earns NSF CAREER award to combat online misinformation and unlock the mystery of black holes          Assistant professor of computer science Evangelos Papalexakis has been awarded the prestigious National Science Foundation NSF CAREER Award on autonomous tensor analysis towards actionable insights from raw multi-aspect data, with applications for detecting misinformation online and detecting gravitational waves.    Read More »aboutUCR computer scientist earns NSF CAREER award to combat online misinformation and unlock the mystery of black holes17 May      Nanofiber filter captures almost 100% of coronavirus aerosols          The filter could help curb airborne spread of COVID-19 virus    Read More »aboutNanofiber filter captures almost 100% of coronavirus aerosols11 May      UCR researchers awarded grant to improve technical communication skills in STEM students          Mona Eskandari, assistant professor of mechanical engineering, Mariam Salloum, assistant teaching professor of computer science, and Annika Speer, assistant teaching professor of theater, film and digital production, were awarded a research grant from the Engineering Information Foundation to enhance technical communication in engineering and science. The proposal identified a need for UC Riverside STEM students to receive more practical coaching, delivery evaluation, and presentation feedback. The executed research goals aim to address these needs by creating tangible public speaking training    Read More »aboutUCR researchers awarded grant to improve technical communication skills in STEM students10 May      Electromagnetic levitation whips nanomaterials into shape          Electromagnetic field directs shape formed by gas phase metal molecules    Read More »aboutElectromagnetic levitation whips nanomaterials into shape07 May      $3 million award to create a new field of research in one-dimensional quantum materials          Alexander Balandin’s Vannevar Bush Faculty Fellowship will help advance quantum materials for electronics and energy conversion    Read More »about$3 million award to create a new field of research in one-dimensional quantum materialsMore from news.ucr.edu                            Top 50                                            U.S. public engineering college U.S. News & World Report                                            9                                            world-class research centers                                            300,000+                                             square feet of lab and research space                                            133                                            Faculty                                            2,864                                            Undergraduate Students                                            936                                            Graduate Students                SearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: 951 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRMarlan and Rosemary Bourns College of Engineering             446 Winston Chung Hall            900 University Ave.             Riverside, CA 92521              tel: 951 827-5190                 fax: 951 827-3188         email: news@engr.ucr.edu Related LinksBCOE Available Conference Rooms and Technology ResourcesGive to BournsIntranetFaculty ResourcesMarketing ResourcesSystemsFollow US:Visit BCOEs Facebook page external site: FacebookFollow BCOE on Twitter external site: TwitterVisit BCOEs YouTube channel external site: YouTubeVisit BCOEs Flickr gallery external site: FlickrSubscribe to BCOE News via RSS FeedPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel" },
    { "url": "https://cen.ucr.edu/", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentA to Z ListingCampus MapFind PeopleNewsSkip to main contentMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGSearchBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringUC Riverside Computer Engineering WE ENGINEER EXCELLENCESearchAdmissionsCurriculumCourse CatalogCSE Grad CoursesECE Grad CoursesCurrent StudentsForms and PetitionsStudent AdvisingGraduate Student AssociationHomeAboutOverviewMessage from the DirectorFaculty and StaffWhy UC RiversideABET AccreditationLatest NewsUndergraduateProgram OverviewProspective StudentsAdmissionsTransferring to UCRCurriculumCombined BS+MSCurrent StudentsStudent AdvisingStudent OrganizationsFrequently Asked QuestionsResearchOverviewCompilers and System SoftwareComputer ArchitectureDigital Design and AutomationEmbedded and Real-Time SystemsHigh-Performance ComputingVLSI Circuits and SystemsContactBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringWelcome to the Computer Engineering ProgramNow Accepting Domestic and International Graduate ApplicationsApply NowBreadcrumbRequest More Info  Apply Statement of SolidarityThe faculty of the Computer Engineering Program expresses support to our Black  community, and stands with them against social injustice and racism.  We commit to listening, learning, and striving to create an environment where Black students, faculty, and staff are treated with compassion and respect.  The program wholeheartedly supports the statement and plan of action outlined in the Bourns College of Engineering solidarity statement. Read the statement here.  \"Computing is fueling a revolution that has changed how we live, work, interact and play. Advances continue at an exciting pace with breakthroughs driven by computing at all scales: from massive data being analyzed by warehouse scale computers, providing insights into science and medicine, to embedded devices integrated within our living spaces and infrastructure.” Program Rankings & Industry Outlook                            No. 52                                            Public Engineering College in the U.S. U.S. News, 2021                                            No. 1                                            Most Transformative University Money Magazine, 2020                                            12th                                            Average Research Area Ranking CS Rankings                                            1.4 Million                                            CEN Occupations Bureau of Labor Statistics, 2018                                            $117K                                            Median salary for Hardware Engineers Bureau of Labor Statistics                                             $105K                                            Median salary for Software Engineers Bureau of Labor Statistics                Recent News14 May      CSE Professor Papalexakis received the NSF CAREER award          The award will support work on autonomous tensor analysis.    Read More »aboutCSE Professor Papalexakis received the NSF CAREER award07 May      $3 million award to create a new field of research in one-dimensional quantum materials          Alexander Balandin’s Vannevar Bush Faculty Fellowship will help advance quantum materials for electronics and energy conversion    Read More »about$3 million award to create a new field of research in one-dimensional quantum materials06 May      Alexander Balandin named DoD Vannevar Bush Faculty Fellow          ECE Distinguished Professor Alexander Balandin has been awarded a 2021 Department of Defense DoD Vannevar Bush Faculty Fellowship . The five-year, highly competitive fellowship is the DoD’s most prestigious single-investigator award with up to $3 million in funding and “supports new, out-of-the-box ideas where research creativity intersects with the unknown.” Balandin was selected to conduct research in one-dimensional quantum materials. His project aims to create a new comprehensive research field of quantum materials consisting of individual atomic chains of van-der-Waals materials with    Read More »aboutAlexander Balandin named DoD Vannevar Bush Faculty Fellow27 Apr      Jay Farrell named new endowed chair          This July, Jay Farrell will step up to the KA Endowed Chair in Electrical and Computer Engineering at UC Riverside’s Marlan and Rosemary Bourns College of Engineering, or BCOE. The new endowed chair was made possible through a $1 million gift from anonymous donors. As one of seven new endowed chairs established at BCOE during UCRs Living the Promise Campaign, the KA Chair was created to recognize faculty in electrical and computer engineering with distinguished records of research, academic, and professional leadership. See the full story at https://insideucr.ucr.edu/stories/2021/04/23/jay    Read More »aboutJay Farrell named new endowed chair19 Mar      ICPC team advances to North American Division Championship          The UCR team, RGBMoon, will be one of nine teams advancing to the ICPC North American Division Championship.    Read More »aboutICPC team advances to North American Division Championship05 Mar      CSE professor Chengyu Song received the NSF CAREER award          Professor Song received the NSF CAREER award for his work on \"scalable of concolic execution.\"    Read More »aboutCSE professor Chengyu Song received the NSF CAREER award03 Mar      Four ECE professors receive prestigious NSF CAREER Awards          Four ECE faculty members received National Science Foundation NSF CAREER Awards this year. This is a remarkable record for a single department. NSF CAREER Awards are given to assistant professors to fund research that is expected to form a firm foundation for a lifetime of leadership in integrating education and research. The four CAREER Award recipients of the ECE department and the projects funded by the award are listed below ordered by award date. Salman Asif is awarded for a project titled \"Optimized Sensing and Recovery for Computational Imaging\". ECE News: https://www.ece.ucr.edu    Read More »aboutFour ECE professors receive prestigious NSF CAREER Awards25 Feb      Konstantinos Karydis receives NSF CAREER Award on Resilient Dynamic Locomotion of Compliant/Soft Legged Robots for Precision Agriculture          Assistant Professor Konstantinos Karydis receives National Science Foundation NSF CAREER award for a project titled \"CAREER: Morphological Computation for Resilient Dynamic Locomotion of Compliant Legged Robots with Application to Precision Agriculture\" The project investigates how compliance embedded into a legged robot can be harnessed to facilitate control and computation, with an eye to enabling efficient and resilient navigation in real agricultural fields. Research activities innovate along three key foundational robotics research directions. 1 Hardware design and dynamic modeling    Read More »aboutKonstantinos Karydis receives NSF CAREER Award on Resilient Dynamic Locomotion of Compliant/Soft Legged Robots for Precision AgricultureMore NewsSearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: 951 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRComputer Engineering Program C/O Computer Science and Engineering               Winston Chung Hall, Room 351            900 University Ave.             Riverside, CA 92521              tel: 951 827-5639                 fax: 951 827-9345         email: contact@cen.ucr.edu Privacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.SearchCancel" }
]