{"url": "https://cen.ucr.edu/", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentA to Z ListingCampus MapFind PeopleNewsSkip to main contentMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGSearchBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringUC Riverside Computer Engineering WE ENGINEER EXCELLENCESearchAdmissionsCurriculumCourse CatalogCSE Grad CoursesECE Grad CoursesCurrent StudentsForms and PetitionsStudent AdvisingGraduate Student AssociationHomeAboutOverviewMessage from the DirectorFaculty and StaffWhy UC RiversideABET AccreditationLatest NewsUndergraduateProgram OverviewProspective StudentsAdmissionsTransferring to UCRCurriculumCombined BS+MSCurrent StudentsStudent AdvisingStudent OrganizationsFrequently Asked QuestionsResearchOverviewCompilers and System SoftwareComputer ArchitectureDigital Design and AutomationEmbedded and Real-Time SystemsHigh-Performance ComputingVLSI Circuits and SystemsContactBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringWelcome to the Computer Engineering ProgramNow Accepting Domestic and International Graduate ApplicationsApply NowBreadcrumbRequest More Info  Apply Statement of SolidarityThe faculty of the Computer Engineering Program expresses support to our Black  community, and stands with them against social injustice and racism.  We commit to listening, learning, and striving to create an environment where Black students, faculty, and staff are treated with compassion and respect.  The program wholeheartedly supports the statement and plan of action outlined in the Bourns College of Engineering solidarity statement. Read the statement here.  \"Computing is fueling a revolution that has changed how we live, work, interact and play. Advances continue at an exciting pace with breakthroughs driven by computing at all scales: from massive data being analyzed by warehouse scale computers, providing insights into science and medicine, to embedded devices integrated within our living spaces and infrastructure.” Program Rankings & Industry Outlook                            No. 52                                            Public Engineering College in the U.S. (U.S. News, 2021)                                            No. 1                                            Most Transformative University (Money Magazine, 2020)                                            12th                                            Average Research Area Ranking (CS Rankings)                                            1.4 Million                                            CEN Occupations (Bureau of Labor Statistics, 2018)                                            $117K                                            Median salary for Hardware Engineers (Bureau of Labor Statistics)                                             $105K                                            Median salary for Software Engineers (Bureau of Labor Statistics)                Recent News14 May      CSE Professor Papalexakis received the NSF CAREER award          The award will support work on autonomous tensor analysis.    Read More »aboutCSE Professor Papalexakis received the NSF CAREER award07 May      $3 million award to create a new field of research in one-dimensional quantum materials          Alexander Balandin’s Vannevar Bush Faculty Fellowship will help advance quantum materials for electronics and energy conversion    Read More »about$3 million award to create a new field of research in one-dimensional quantum materials06 May      Alexander Balandin named DoD Vannevar Bush Faculty Fellow          ECE Distinguished Professor Alexander Balandin has been awarded a 2021 Department of Defense (DoD) Vannevar Bush Faculty Fellowship . The five-year, highly competitive fellowship is the DoD’s most prestigious single-investigator award with up to $3 million in funding and “supports new, out-of-the-box ideas where research creativity intersects with the unknown.” Balandin was selected to conduct research in one-dimensional quantum materials. His project aims to create a new comprehensive research field of quantum materials consisting of individual atomic chains of van-der-Waals materials with    Read More »aboutAlexander Balandin named DoD Vannevar Bush Faculty Fellow27 Apr      Jay Farrell named new endowed chair          This July, Jay Farrell will step up to the KA Endowed Chair in Electrical and Computer Engineering at UC Riverside’s Marlan and Rosemary Bourns College of Engineering, or BCOE. The new endowed chair was made possible through a $1 million gift from anonymous donors. As one of seven new endowed chairs established at BCOE during UCR's Living the Promise Campaign, the KA Chair was created to recognize faculty in electrical and computer engineering with distinguished records of research, academic, and professional leadership. See the full story at https://insideucr.ucr.edu/stories/2021/04/23/jay    Read More »aboutJay Farrell named new endowed chair19 Mar      ICPC team advances to North American Division Championship          The UCR team, RGBMoon, will be one of nine teams advancing to the ICPC North American Division Championship.    Read More »aboutICPC team advances to North American Division Championship05 Mar      CSE professor Chengyu Song received the NSF CAREER award          Professor Song received the NSF CAREER award for his work on \"scalable of concolic execution.\"    Read More »aboutCSE professor Chengyu Song received the NSF CAREER award03 Mar      Four ECE professors receive prestigious NSF CAREER Awards          Four ECE faculty members received National Science Foundation (NSF) CAREER Awards this year. This is a remarkable record for a single department. NSF CAREER Awards are given to assistant professors to fund research that is expected to form a firm foundation for a lifetime of leadership in integrating education and research. The four CAREER Award recipients of the ECE department and the projects funded by the award are listed below (ordered by award date). Salman Asif is awarded for a project titled \"Optimized Sensing and Recovery for Computational Imaging\". ECE News: https://www.ece.ucr.edu    Read More »aboutFour ECE professors receive prestigious NSF CAREER Awards25 Feb      Konstantinos Karydis receives NSF CAREER Award on Resilient Dynamic Locomotion of Compliant/Soft Legged Robots for Precision Agriculture          Assistant Professor Konstantinos Karydis receives National Science Foundation (NSF) CAREER award for a project titled \"CAREER: Morphological Computation for Resilient Dynamic Locomotion of Compliant Legged Robots with Application to Precision Agriculture\" The project investigates how compliance embedded into a legged robot can be harnessed to facilitate control and computation, with an eye to enabling efficient and resilient navigation in real agricultural fields. Research activities innovate along three key foundational robotics research directions. 1) Hardware design and dynamic modeling    Read More »aboutKonstantinos Karydis receives NSF CAREER Award on Resilient Dynamic Locomotion of Compliant/Soft Legged Robots for Precision AgricultureMore NewsSearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: (951) 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRComputer Engineering Program C/O Computer Science and Engineering               Winston Chung Hall, Room 351            900 University Ave.             Riverside, CA 92521              tel: (951) 827-5639                 fax: (951) 827-9345         email: contact@cen.ucr.edu Privacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.SearchCancel"}
{"url": "https://www.engr.ucr.edu/", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentMarlan and Rosemary Bourns College of EngineeringBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringSearchUC Riverside Marlan and Rosemary Bourns College of Engineering Celebrating 30 YearsSearchStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership Departments and ProgramsBioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMaster's in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership BioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMaster's in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in Engineering            Calling all 2021 graduates!                We want to hear about your next destination. Share your story to help future cohorts get a glimpse of “what’s next” after graduation.Share Story            Transfer Student Experiences    Learn more            Graduate Students in Charge    Learn more about our graduate programs            The Bourns College of Engineering    Find out how you can givePreviousNextBreadcrumbNews03 Jun      A new water treatment technology could also help Mars explorers          A catalyst that destroys perchlorate in water could clean Martian soil     Read More »aboutA new water treatment technology could also help Mars explorers02 Jun      Poor air quality and warehouses linked to Inland Empire Covid-19 inequities          UC Riverside professors call for intersectional approach to Covid-19 exposure interventions    Read More »aboutPoor air quality and warehouses linked to Inland Empire Covid-19 inequities26 May      $79,000 raised for Professor Emeritus Tom Payne’s 79th birthday          The Thomas H. Payne Scholarship in Computer Science, which supports undergraduate students in computer science, has grown to $79,079, just in time for Professor Payne's 79th birthday.    Read More »about$79,000 raised for Professor Emeritus Tom Payne’s 79th birthday25 May      UC Riverside offers UC system's first master's degree in robotics          Algorithmic bias is one problem the program will tackle    Read More »aboutUC Riverside offers UC system's first master's degree in robotics24 May      Tiny tomatoes could mean big profits for urban agriculture          Grants support continued development of tomatoes for vertical farming    Read More »aboutTiny tomatoes could mean big profits for urban agriculture21 May      Implantable piezoelectric polymer improves controlled release of drugs          Repeated tests showed a similar amount of drug release per activation, confirming robust control of release rate    Read More »aboutImplantable piezoelectric polymer improves controlled release of drugs21 May      Bourns Science and Engineering Day expands STEM outreach to include school districts in Orange County and Los Angeles County          Each year, the Society of Women Engineers (SWE), one of the Marlan and Rosemary Bourns College of Engineering’s (BCOE) more than 20 professional student organizations, hosts Bourns Science and Engineering Day (BSED), formerly called Bourns Engineering Day, a community outreach event introducing STEM to local K-12 students through activities, speakers and lessons. Despite this year’s event moving completely online for the first time, due to the remote setting, many more schools were able to attend in addition to typical attendees from Riverside Unified School District. Students and teachers    Read More »aboutBourns Science and Engineering Day expands STEM outreach to include school districts in Orange County and Los Angeles County18 May      UCR computer scientist earns NSF CAREER award to combat online misinformation and unlock the mystery of black holes          Assistant professor of computer science Evangelos Papalexakis has been awarded the prestigious National Science Foundation (NSF) CAREER Award on autonomous tensor analysis towards actionable insights from raw multi-aspect data, with applications for detecting misinformation online and detecting gravitational waves.    Read More »aboutUCR computer scientist earns NSF CAREER award to combat online misinformation and unlock the mystery of black holes17 May      Nanofiber filter captures almost 100% of coronavirus aerosols          The filter could help curb airborne spread of COVID-19 virus    Read More »aboutNanofiber filter captures almost 100% of coronavirus aerosols11 May      UCR researchers awarded grant to improve technical communication skills in STEM students          Mona Eskandari, assistant professor of mechanical engineering, Mariam Salloum, assistant teaching professor of computer science, and Annika Speer, assistant teaching professor of theater, film and digital production, were awarded a research grant from the Engineering Information Foundation to enhance technical communication in engineering and science. The proposal identified a need for UC Riverside STEM students to receive more practical coaching, delivery evaluation, and presentation feedback. The executed research goals aim to address these needs by creating tangible public speaking training    Read More »aboutUCR researchers awarded grant to improve technical communication skills in STEM students10 May      Electromagnetic levitation whips nanomaterials into shape          Electromagnetic field directs shape formed by gas phase metal molecules    Read More »aboutElectromagnetic levitation whips nanomaterials into shape07 May      $3 million award to create a new field of research in one-dimensional quantum materials          Alexander Balandin’s Vannevar Bush Faculty Fellowship will help advance quantum materials for electronics and energy conversion    Read More »about$3 million award to create a new field of research in one-dimensional quantum materialsMore from news.ucr.edu                            Top 50                                            U.S. public engineering college (U.S. News & World Report)                                            9                                            world-class research centers                                            300,000+                                             square feet of lab and research space                                            133                                            Faculty                                            2,864                                            Undergraduate Students                                            936                                            Graduate Students                SearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: (951) 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRMarlan and Rosemary Bourns College of Engineering             446 Winston Chung Hall            900 University Ave.             Riverside, CA 92521              tel: (951) 827-5190                 fax: (951) 827-3188         email: news@engr.ucr.edu Related LinksBCOE Available Conference Rooms and Technology ResourcesGive to BournsIntranetFaculty ResourcesMarketing ResourcesSystemsFollow US:Visit BCOE's Facebook page (external site: Facebook)Follow BCOE on Twitter (external site: Twitter)Visit BCOE's YouTube channel (external site: YouTube)Visit BCOE's Flickr gallery (external site: Flickr)Subscribe to BCOE News via RSS FeedPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel"}
{"url": "https://highlanderlink.ucr.edu/organization/ewb", "html": "This application requires JavaScript to be enabled."}
{"url": "https://www.engr.ucr.edu/covid-19-information-page", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentMarlan and Rosemary Bourns College of EngineeringBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringSearchUC Riverside Marlan and Rosemary Bourns College of Engineering Celebrating 30 YearsSearchStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership Departments and ProgramsBioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMaster's in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership BioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMaster's in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringBreadcrumbCOVID-19 Information PageCOVID-19 Information PageVIEW CAMPUS STATUSTo learn the latest on campus reopening efforts, visit the Campus Return website.QUESTIONS? Review the BCOE FAQ prior to contacting team members for assistance:BCOE COVID-19 FAQsDaily Wellness Check For UCR employees and students with UCRNetID For visitors without a UCRNetIDTO OBTAIN PPE & FACE COVERINGS: Learn moreI'm searching for guidance on: Instruction ContinuitySpring 2021\tInstruction will be in online or remote formats for the entire quarter.UCR recommendations for instruction continuity: UCR Keep Teaching Website Zoom is the predominant method being suggested\tZoom Security and Best PracticesBCOE has requested Zoom Pro licenses for all BCOE Instructors, check your access at this link using your NetIDView a Zoom tutorial on creating assessments (e.g., exams) through iLearnWorkshop on course delivery via Zoom\t\tCampus-wide online discussion board for questions Faculty resources shared during BCOE Zoom meeting:Poll EverywhereGradescopeiClicker (offering free access due to COVID-19)  Academic PersonnelFor questions about purchasing, please contact your department/program purchasing assistant. They have the most current information on policies and procedures to ensure reimbursements are approved.VPAP Memo: Stop the Clock, and other items (3/20/2020) \tVPAP Walker Memo COVID-19 3 20 2020.pdf Research ContinuityView the latest on research ramp-up guidelines hereFollowing are requirements for all persons visiting campus: 1. Complete the COVID-19 Prevention TrainingTo complete the course, please proceed as follows:\tLog into R'Space (http://www.rspace.ucr.edu)Under Authorized Applications use the link to the UC Learning Center (LMS). This will take you to http://ucrlearning.ucr.edu, where you may also login directly.Click Login Now!On the homepage, click on the Required Training buttonClick the Start button to the left of the activity nameFor tips on eCourses, browser compatibility, and user guides, visit the UCR UC Learning Center support site. If you need assistance accessing the UC Learning Center, please email ucrlearning@ucr.edu. If you have questions about this, please email ehstraining@ucr.edu.2. Obtain permission (see below) either as a research group member for an approved research ramp-up proposal, or for a one-time visit.3. Check in and check out when entering and leaving campus rooms either by scanning the QR codes on the door, or by explicitly selecting room numbers at https://intra.engr.ucr.edu/apps/researchscheduler/user/checkin.phpTo submit a ramp-up proposal to resume on-campus research (research PIs only)https://ehs.ucr.edu/coronavirus/returnTo request a one-time permission to come to campusComplete the COVID-19 Prevention TrainingFill out and submit the form at https://forms.gle/74JfGo23bQ16br2S8Log all entries and exit via QR scanning or at https://intra.engr.ucr.edu/apps/researchscheduler/user/checkin.phpFor instructions click here Continually check the FAQ document for the latest updates on research activities.If you need PPE or face coverings, refer to the June 9 email from EH&S.Research ramp-up efforts will begin June 8 with researchers meeting special requirements as outlined by the Office of Research and Economic Development.Alert your Department LSO activities, equipment or materials requiring monitoring and the necessary frequency. During research ramp-up, safety protocols in a lab will remain in place. (SOP for Working Alone in the Lab)Follow building security requirements in the BCOE Space Use Policy.Check campus COVID-19 information pages frequently. Create a contact sheet for your lab including contact information for the faculty member and a secondary contact. Share this information with your Chair and your LSO.Guidance for asymptomatic on-site personnel who do not have healthcare duties (Posted April 6).Remote AccessAccessing VPNAccessing Remote DesktopTravelhttps://ehs.ucr.edu/coronavirus#information_for_travelersAdministrative Documents - Leave Access, Charging C&G, New Hire Guidance, etc.April 15: COVID-19 related leave and job protection guidance UCR Human Resources COVID-19 Information PageMarch 26: Charging C&G Costs to Federal Sponsored Awards During COVID-19March 20: New Hire GuidanceMarch 26: Leave Guidance for Supervisors of Academic Appointments - UPDATEMarch 19: Leave Guidance for Supervisors of Academic AppointmentsInformation TechnologyBourns EngineeringComputer ScienceSystems reminder: Confirm your computers are up to date with patches and virus/malware protectionBe aware of COVID-19 related computer viruses. Use caution when searching online and verify links are secure prior to clicking on them.\t\tLearn about fake online COVID-19 related information page.April 1 U.S. Secret Service message re: malicious emails  Library ServicesSee the Library information page for available services FacilitiesIf you are on campus and identify an emergency issue, please do the following: call 951-827-4677 AND also email facilities@ucr.edu. As of April 3, EH&S has indicated the following services are continuing but are subject to change at any time:Hazardous waste pick upProcessing of radiation ordersProcessing controlled substances orderIBC, IACUC, and RSC reviewsLaboratory evaluations of any kind will not be scheduled or conducted during this time.April 15: Facilities services that are continuing.  COVID-19 Info and Stats June 9 PPE and face coverings email from EH&SMay 30 research ramp-up notification by the Office of Research and Economic Development.May 9 updated Riverside County OrderApril 2 Order: Extension of school closures to June 19March 31 public health recommendation to cover the faceAmended March 13 Order on school closures by the Public Health Officer of the County of RiversideMarch 16 Order on gatherings by the Public Health Officer of the County of RiversideMarch 13 Order on school closures by the Public Health Officer of the County of Riversidehttps://ehs.ucr.edu/coronavirus/faq_faculty-staffUCOP COVID-19 webpageCDCCDC COVID-19 FAQs QUESTIONS? Review the BCOE FAQ prior to contacting team members for assistance:BCOE COVID-19 FAQsContactsWebsite Suggestions: Jay Farrell, farrell@ece.ucr.eduInstruction: Marko Princevac, marko@engr.ucr.eduResearch: Chinya Ravishankar, ravi@cs.ucr.eduBusiness Operations: Alissa Rackstraw, alissa@engr.ucr.eduInformation Technology: John Cleary, john@engr.ucr.edu, or Victor Hill, vhill@cs.ucr.eduSafety and Facilities: Perry Cheung for safety at pcheung@engr.ucr.edu or Todd Ambriz for facilities at tambriz@engr.ucr.eduSearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: (951) 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRMarlan and Rosemary Bourns College of Engineering             446 Winston Chung Hall            900 University Ave.             Riverside, CA 92521              tel: (951) 827-5190                 fax: (951) 827-3188         email: news@engr.ucr.edu Related LinksBCOE Available Conference Rooms and Technology ResourcesGive to BournsIntranetFaculty ResourcesMarketing ResourcesSystemsFollow US:Visit BCOE's Facebook page (external site: Facebook)Follow BCOE on Twitter (external site: Twitter)Visit BCOE's YouTube channel (external site: YouTube)Visit BCOE's Flickr gallery (external site: Flickr)Subscribe to BCOE News via RSS FeedPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel"}
{"url": "https://ehs.ucr.edu/coronavirus/return", "html": "Skip to main contentPlanning Budget & AdministrationReport a Incident, Injury or Safety ConcernReport a COVID-19 or Public Health ConcernSearchUC Riverside Environmental Health & Safety SearchAbout EH&SOrganizational ChartPrograms & PoliciesStaff DirectoryWho Do I Call?How Can We Help?Programs & PoliciesFood Permit RequestHazardous Waste Pick UpLog into Chemicals, INSPECT, LHAT, & WASTe AppsPersonal Protective Equipment (PPE)Programs & ServicesTrainingCOVID-19 Prevention TrainingReportCOVID-19 ConcernSafety ConcernWork Related Injury/IllnessReport a Incident, Injury or Safety ConcernReport a COVID-19 or Public Health ConcernFace Coverings are required while on campus. Staff/Faculty may request a face covering from EH&S. Students may request a face covering from The Well.×BreadcrumbCoronavirusReopening WorkReturn to Campus protocols As always, your health and well-being are our primary concern. If you are able to do your job effectively without returning to campus, we urge you to talk with your supervisor about continuing to work remotely. As more people get vaccinated and the overall level of new COVID-19 cases declines across the country, we are easing out of the worst public health crisis in a generation. All returns to the workplace must be pre-approved. If you have any questions or concerns about this, please speak with your supervisor. The guidance below applies to all employees who perform duties on campus or UC leased or affiliated properties, unless the facility has expressly provided different instructions. Deans and unit heads will determine which groups are needed to work in person. For those who are approved to return, we are instituting new protocols designed to protect yourself and others. We expect all on-campus workers to abide by the guidelines and directives described below.SupervisorsAuthorization. Provide authorization for each employee to report onsite. Worksite specific plan. Must develop own Worksite Specific Plan . In some cases, the Worksite Specific Plan may be routed to campus oversight committees for review and approval prior to return to campus. Positive case? Refer to the COVID-19 Symptom monitoring and reporting procedures and Response to suspected COVID-19 cases: Guide for Department Leads, Supervisors, Chairs\". Download the quick reference for Supervisors Infographic.For All Returning EmployeesCOVID-19 Prevention Plan Campus GuidanceCOVID-19 Prevention PlanThe campus has developed general guidance, which all employees should review.Prior to your return, your supervisor must share their Worksite Specific Plan with all their employees, and you must review and acknowledge.Download the When To Return guidance infographic. You can also view the Return to Campus Working Group webinars on You Tube. TrainingCOVID-19 PREVENTIONAll employees who plan to be on-site are required to view a training video, \"COVID-19 prevention training\" as required by CDPH/CalOSHA before returning to campus.  Even if you will continue to work remotely, but may need to come to campus occasionally, you must complete this training. This course is accessible in the UC Learning Center. Training WellnessUCR COVID-19 DAILY WELLNESS CHECK SURVEYAll employees who work on-site at a UCR property (owner or leased) must complete a survey prior to reporting for work. If you have symptoms or concerns about exposure, contact your primary care physician and the Wellness Hotline (844) 827-6827. For more information, refer to the COVID-19 Symptom monitoring and reporting procedures (SOP).Daily wellness check  EMPLOYEE WELLNESS PROGRAMThe UCR Wellness Program focuses on promoting awareness and education, motivation for positive behavior changes, and influencing campus practices and policy to support a healthy environment.WellnessFACULTY STAFF ASSISTANCE PROGRAMComPsych will provide GuidanceResources® services whose benefits will provide UCR faculty, staff and their household family members confidential support, resources and information for personal and work-life issues, free of chargeFaculty Staff Assistance ProgramFace coveringIn compliance with the UC order and the California Department of Public Health all individuals on UC property are required to wear face coverings. EH&S is offering face coverings to all campus employees. Submit a request using the button below. Supervisors may request on behalf of their staff using the Face Covering Request form.Face Covering RequestHygiene Disinfectant and sanitizersOrder a disinfectant kit from Facilities services (includes disinfectant, painter’s tape, shop towels, and other items).  Download the Disinfecting Infographic for an at a glace guide.  Disinfectant KiT Request HandwashingAll employees must practice good hygiene by frequently washing your hands with soap and water for 20 seconds or longer. When possible, use soap and water instead of hand sanitizer. Watch this short video on proper handwashing.Custodial A summary of COVID-19 Building Ventilation, Lab Sanitation, Disinfecting and Cleaning schedule as of July 10, 2020 (view the schedule in the link below). Learn more at Facilities Services Campus Return Support Information view details on cleaning schedule.Guidance Document and ScheduleVentilationAll campus buildings that are open to the public during normal times are safe environments. Some of our buildings are much older and have some limitations. Our buildings are designed to provide sufficientair changes based on building activities. We are making a special effort to ensure that all buildings have current filter changes. The information below is how HVAC systems are maintained.Expanded Timeframe: To help with airflow, Facilities Services is expanding the length of time outside airflow will circulate throughout each building.Filtration Maintenance: Building filtration systems are well maintained and have the appropriate level of filters for each building.Air Flow: To accommodate efficient airflow in each building, the most advanced level of filtersare being used based on the building’s air filtration system capabilities.Building VentilationStrict adherence to the public health posters and other visual cues throughout campus and in buildings will reduce transmission risks. Ventilation systems will continue to operate as designed even thoughbuilding occupancy will be reduced. This will further reduce the risk of potential airborne transmission.  While each individual occupant of a campus building will want to make sure these guidelines arefollowed, including limited occupancy, it will be very important to ensure that all the other occupants in that building, at least on that same floor, coordinate to ensure the overall density and guidelines arebeing followed on a collective basis.Transmission Reduction EffortsAccording to the World Health Organization (WHO) and the Centers for Disease Control (CDC), the COVID-19 virus appears to spread human-to-human through respiratory droplets coming from an infected person. Based on public health guidance, the key transmission reduction factors include:social distancing,limiting occupancy,practicing good personal hygiene, andutilizing face coveringsAs part of the public health guidance, Facilities Services will disinfect high-touch areas including elevators, door handles, common areas and restrooms. We have made disinfecting kits available to departments and hand sanitizing stations are located at the entrance of each building. A map locating sanitizing stations can be viewed by clicking here. HVAC ventilation FAQ'sResources and SOPsSignageThe campus has developed standard signage and postings for building entrances, exits, stairs, elevators and more. Download and post signage through your work areas.COVID-19 Campus SignaGEThe following posters are installed throughout campus:Keep yourself healthy Face covering requiredElevator (1 person maximum)Wait here (footprints)Do not use (this area is closed)To obtain additional signs complete the COVID-19 signage request.Standard Operating Procedures (SOP)General Areas: Office SpaceGeneral Area/Office Space Disinfection SOPLaboratories\tLaboratory/Research Space Disinfection SOPFacilities\tDisinfection response plan SOPShared VehicleTo reduce the spread of COVID-19, avoid sharing UCR vehicles whenever possible. Employees may share vehicles only if approved in advance and in writing by a supervisor. Review this Shared Vehicle Guidance for details.Visitors & ContractorsWe recognize that visitors, contractors, vendors and other non-UCR personnel may need to come to campus.Contract employees working through third party employers must follow all campus protocols.Contract employees are required to continue following all Non-Pharmaceutical Interventions (NPI), such as masking, physical distancing, hygiene, daily wellness checks until further noticeContract units must complete and submit a copy of their WSSP or provide their employer’s equivalent documentation to ehspublichealth@ucr.eduNon-UCR affiliated individuals coming to campus for essential work must abide by visitor guidelines. Non-UCR Affiliate information TravelEmployees who have travelled domestically or internationally, whether for personal or business purposes should refer to the following guidelines and restrictions regarding travel. Travel GuidelinesQuick LinksCampus ReturnHotlineUCR Daily Wellness Check SurveyHuman Resources COVID-19 ResourcesStudent Health ServicesCampus Emergency StatusKeep TeachingKeep LearningKeep WorkingKeep ResearchingCoronavirus ResourcesFace Covering RequestResearch Ramp UpSearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: (951) 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRUniversity of California, Riverside             Environmental Health & Safety             900 University Ave.             Riverside, CA 92521              tel: (951) 827-5528                 fax: (951) 827-5122         email: ehs@ucr.edu  Find UsRelated LinksCoronavirus Resources & UpdatesCustomer Service Satisfaction Survey for EH&SEmergency ManagementFire & Life SafetyRisk & Safety Solutions Web Application Log InRisk ManagementUC Police DepartmentUC Risk & Safety TrainingPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel"}
{"url": "https://forms.gle/MuniHhmD3mvPLZH77", "html": "Request for short, one-time visit to BCOE facilitiesThis form is only for one-time requests to come to campus. To submit research ramp-up proposals, please go to https://forms.gle/jh7XKvEcuDpK7gyK7.* RequiredEmail *Your emailYour name *Your answerOn-campus presence requires you to complete the COVID-19 training at the UC Learning Center (LMS). Have you completed this training? *YesNoWill you ensure that before coming to campus, you will complete the UCR Symptom Monitoring Survey at https://ucriverside.az1.qualtrics.com/jfe/form/SV_cZwHeZMQU2F6Tsx?  If you are requesting permission for an external visitor, they must complete the Symptom Monitoring Survey at https://ucriverside.az1.qualtrics.com/jfe/form/SV_00Lu8W4mqmIdsqx. *YesNoNextNever submit passwords through Google Forms.This content is neither created nor endorsed by Google. Report Abuse - Terms of Service - Privacy Policy Forms  "}
{"url": "https://ucriverside.az1.qualtrics.com/jfe/form/SV_cOB8gBU6OVulQax", "html": "Javascript is required to load this page."}
{"url": "https://www.ucr.edu/alpha", "html": "COVID-19 information and guidance. Information about and returning to campus. The Accellion attack impacted University of California (UC), as it previously disclosed in early April. To get the latest information about this event, our response, and available credit protection services, please visit this page.×A to Z ListingCampus MapFind PeopleNewsSkip to main contentUniversity of California, RiversideSearchQuicklinksVisitEventsMake a GiftCampus MapJobsLibraryParking and TransportationApplyUC Riverside University of California, Riverside  University of California, Riverside SearchAbout About OverviewRankings and FactsImpacts HistoryVisitors InternationalLeadership Find Information for...Current StudentsProspective StudentsFacultyStaffParentsAlumniAcademics Academics OverviewUndergraduate Majors Graduate ProgramsColleges and Schools UCR Extension Find Information For... Current StudentsProspective StudentsFacultyStaffParentsAlumniAdmissions Admissions OverviewUndergraduate Admissions Graduate AdmissionsInternational Admissions Transfer AdmissionsCostVeteran Admissions Find Information For... Current StudentsProspective StudentsFacultyStaffParentsAlumniResearch Research OverviewUndergraduate Research Graduate ResearchCenters and Facilities Library Find Information For...Current StudentsProspective StudentsFacultyStaffParentsAlumniCampus Life Campus Life OverviewEventsCampus Map Arts and CultureAthletics and RecreationHealth and Safety Botanic GardensHousingDiningAbout Riverside Find Information For... Current StudentsProspective StudentsFacultyStaffParentsAlumniQuicklinksVisitEventsMake a GiftCampus MapJobsLibraryParking and TransportationApplyBreadcrumbA-Z ListingA-Z Listing            A    A. Gary Anderson Graduate School of ManagementAP Readiness ProgramAcademic CalendarAcademic Cluster HiringAcademic ComputingAcademic Information SystemsAcademic Integrity, GraduateAcademic Integrity, UndergraduateAcademic JobsAcademic Personnel eFile SystemAcademic Personnel OfficeAcademic Personnel Recruit System (AP Recruit)Academic Planning & BudgetAcademic Resource Center (ARC)Academic SenateAcademy of Distinguished TeachersAccounting ServicesAccounts PayableAccreditationAdministrative Policies and ProceduresAdministrative ResolutionAdministrative StudiesAdmissions, GraduateAdvancement OfficeAdvancement Services / Gift AdministrationAfrican Student ProgramsAgricultural OperationsAGSM (Anderson Graduate School of Management)AIDS/HIVAlumni AssociationAnalytical Writing Placement ExamAnderson Graduate School of ManagementAnnual FundAnthropology DepartmentAP Recruit (Academic Personnel Recruit System)APB (Academic Planning & Budget)Application & Multimedia Development (AMD)Application Status, UndergraduateApply to Graduate SchoolARC (Academic Resource Center)Architects and EngineersArt DepartmentArt Facilities AdministrationArt History DepartmentArtsBlockAsian Pacific Student ProgramsAsian Studies ProgramASPB (Associated Student Program Board)Associated Student Program Board (ASPB)Associated Students of UCR (ASUCR)ASUCRAt Your Service (Benefits)AthleticsAudit & Advisory ServicesAuxiliary Design ServicesAVC Diversity, Excellence & EquityAvocado Information            B    Bagpipe BandBarbara and Art Culver Center of the ArtsBargaining Agreements & Personnel PoliciesBarn (restaurant)BAS (Business and Administrative Services)BCOE (Bourns College of Engineering)Bear FactsBear TracksBee InformationBell TowerBenefitsBibliographical Studies and Research, Center forBiochemistry DepartmentBioengineering DepartmentBioengineering Research CenterBiomedical Sciences Graduate ProgramBlackboardBlock PartyBlum Initiative for Global and Regional PovertyBNN AdministrationBookstoreBotanic GardensBotany & Plant Sciences DepartmentBourns College of EngineeringBourns College of Engineering-Center for Environmental Research & Technology (CE-CERT)Box Office for Fine ArtsBudget and PlanningBudget News and InformationBug InformationBusiness and Administrative ServicesBusiness and Financial ServicesBusiness School            C    Calendar of EventsCalendar, Academic (holidays, spring, winter break)California Center for Native Nations (CCNN)Campaign for UC RiversideCampus Business ServicesCampus CounselCampus Delegations of AuthorityCampus DirectoryCampus Electronics ServicesCampus Enrollment StatisticsCampus EscortCampus Health CenterCampus MapCampus NewsCampus Organizational ChartsCampus PlanningCampus Police DepartmentCampus RestaurantsCampus Style GuideCampus ToursCampus VeterinarianCampusStoreCapital Asset StrategiesCard ServicesCareer CenterCarillonCase ManagerCashiers OfficeCatalog, GeneralCatalysis CenterCaTEACHCateringCCNN (California Center for Native Nations)CDS (Common Data Set)CDS (Creative Design Services)CE-CERT (College of Engineering-Center for Environmental Research & Technology)Cell Biology & Neuroscience DepartmentCell, Molecular, & Developmental Biology Graduate ProgramCenter for Bibliographical Studies and ResearchCenter for Bioengineering ResearchCenter for CatalysisCenter for Conservation BiologyCenter for Crime and Justice StudiesCenter for Disease Vector ResearchCenter for Environmental Research & Technology (CE-CERT)Center for Glial-Neuronal InteractionsCenter for Healthy CommunitiesCenter for Iberian and Latin American MusicCenter for Ideas & SocietyCenter for Integrative Biological CollectionsCenter for Invasive Species ResearchCenter for Molecular and Translational MedicineCenter for Nanoscale Science & EngineeringCenter for Plant Cell Biology (CEPCEB)Center for Research in Intelligent Systems (CRIS)Center for Social & Economic Policy (CSEP)Center for Social InnovationCenter for Stem Cell ResearchCenter for Sustainable Suburban DevelopmentCenter for Visual ComputingCentral Facility for Advanced Microscopy & MicroanalysisCEPCEB (Center for Plant Cell Biology)CERT (College of Engineering-Center for Environmental Research & Technology)Certification of Disability StatusCFAMM (Central Facility for Advanced Microscopy & Microanalysis)Challenge Course Team BuildingChancellor's DinnerChancellor's OfficeChange of AddressCHASS (College of Humanities, Arts, & Social Sciences)CHASS ConnectCHASS F1RST: First-Year Experience ProgramsCHASS Student AffairsChemical & Environmental Engineering DepartmentChemical AnalysesChemistry DepartmentChicano Student ProgramsChief Compliance OfficeChild Care CenterChild Development CenterCIBC (Center for Integrative Biological Collections)CIF (Core Instrumentation Facility)Citrus Clonal Protection ProgramCitrus Grove CateringCitrus Variety CollectionClasses, ScheduleClassical Studies ProgramClassroom TechnologyClery Act Security ReportClimbing WallClubs, StudentCluster HiringCMDB (Cell, Molecular, & Developmental Biology Graduate Program)CMP (California Museum of Photography)CNAS (College of Natural & Agricultural Sciences)CNAS Graduate Student Affairs CenterCNAS Student Academic AffairsCNAS Undergraduate Academic Advising CenterCNSE (Center for Nanoscale Science & Engineering)COE (Bourns College of Engineering)College of Engineering Student AffairsCollege of Engineering-Center for Environmental Research & Technology (CE-CERT)College of Humanities, Arts, & Social SciencesCollege of Humanities, Arts, & Social Sciences Student AffairsCollege of Natural & Agricultural SciencesCollege of Natural & Agricultural Sciences Student Academic AffairsCommencementCommittee on HIV/AIDSCommon Data SetCommonsCommunications & Networks Group (COMNET)COMNET (Communications & Networks Group)Comparative Ancient Civilizations ProgramComparative Literature & Foreign Languages DepartmentComputer EngineeringComputer LabsComputer Science & Engineering DepartmentComputer Support ServicesComputer Virus AlertsComputing & CommunicationsComputing, AcademicConcurrent EnrollmentConferences, Events & Catering ServicesConflict ResolutionConflict Resolution and Peace Studies Lectureship, Forrest S. MostenContinuing EducationConvocationCore Instrumentation FacilityCost of Attendance EstimationsCounseling CenterCourse CatalogCourse Notes & Lectures (iLearn)Course Request and Maintenance SystemCrate Literary Magazine (now Santa Ana River Review)Creative Design ServicesCreative Writing and Writing for the Performing Arts MFACreative Writing DepartmentCreative Writing MFA (Palm Desert)Crime StatisticsCRIS (Center for Research in Intelligent Systems)CSEP (Center for Social & Economic Policy)CSSD (Center for Sustainable Suburban Development)Culver Center of the Arts            D    Dance DepartmentDaycare CenterDean of StudentsDeep Canyon Desert Research CenterDemographic DataDepartment of Agricultural OperationsDepartment of Creative WritingDepartment of Electrical & Computer EngineeringDevelopment OfficeDining ServicesDining Services Food TrucksDirections to CampusDirectory, StaffDisability ManagementDisability ServicesDisabled Veterans Scholarship ProgramDiscover DayDisease Vector Research CenterDistance LearningDistinguished Teachers AcademyDistribution ServicesDiversityDonor Week            E    -mail ServicesEAOP (Early Academic Outreach Program)Early Childhood Services (ECS)Earth Sciences DepartmentEast Asian Languages ProgramEaton Collection of Science Fiction & FantasyEaton Science Fiction ConferenceEconomics DepartmentEducation & Employee DevelopmentEducation AbroadeFile (Academic Personnel eFile System)EH&S (Environmental Health & Safety)Electrical & Computer Engineering DepartmentElectron MicroscopyElectronic AnnouncementsElectronic Course CatalogEmergency Notification SystemEmeriti AssociationEmerson Oaks ReserveEmployee Compensation & ClassificationEmployee RelationsEmployment, FacultyEmployment, StaffEmployment, StudentEnglish DepartmentEnglish Language ProgramsEnrollment StatisticsENS (Emergency Notification System)Enterprise DirectoryEnterprise Risk ManagementEnterprise Workplace Systems (iViews)Entomology DepartmentEntry Level Writing RequirementEnvironmental Health & SafetyEnvironmental Sciences DepartmentEnvironmental Toxicology ProgramEquipment ManagementErgonomics ProgramEscort Service (Campus Safety)ESL (English as a Second Language)Ethnic Studies DepartmentEvaluation and Assessment, Office of Undergraduate EducationEVC (Executive Vice Chancellor) and ProvostEvent Management & ProtocolEvents CalendarEvolution, Ecology, and Organismal Biology, Department of (formerly Biology)Evolution, Ecology & Organismal Biology Graduate ProgramExcess Property (Surplus)Exchange E-mailExotic PestsExperts on DemandExtension ClassesExternal Relations            F    Facilities ServicesFacts about UCRFaculty & Staff Assistance ProgramFaculty and Staff HousingFaculty Cluster HiringFaculty Computer SupportFaculty Employment OpportunitiesFaculty Housing ProgramFaculty JobsFaculty-Led Education Abroad Programs (FLEAP)Faculty Mentorship ProgramFaculty NewsletterFAQs about Financial AidFastStart ProgramFederal Work-Study ProgramFiat LuxFinancial Aid FAQFinancial Aid for VeteransFinancial Aid OfficeFinancial Planning & AnalysisFind PeopleFine Arts Ticket OfficeFingerprintingFleet ServicesFood ServicesFood TrucksForeign Language Placement TestForrest S. Mosten Conflict Resolution and Peace Studies LectureshipFoster Care YouthFoundationFrench Language ProgramFreshman OrientationFuture Physician Leaders Program (FPL)            G    GEARSGender and Sexuality Studies DepartmentGender Education & Resource ServicesGeneral CatalogGenetics, Genomics and Bioinformatics Graduate ProgramGenome Biology InstituteGeographic Information SystemsGerman Language ProgramGGB (Genetics, Genomics and Bioinformatics)GI BillGift AdministrationGift PlanningGlial-Neuronal Interactions CenterGlobal StudiesGluck Fellows Program of the Arts at UC RiversideGME (Graduate Medical Education)Golden ARCHES Peer Health Education ProgramGovernmental & Community RelationsGrad Track ProgramGradSuccessGraduate AdmissionsGraduate DivisionGraduate Medical Education Program (GME)Graduate Program in Evolution, Ecology & Organismal BiologyGraduate Program in Genetics, Genomics and BioinformaticsGraduate Program in Plant PathologyGraduate Program in Southeast Asian StudiesGraduate School and Professional School Exam Preparation SeminarsGraduate School of EducationGraduate School of ManagementGraduate Student AssociationGraduate Student Financial SupportGraduate Student Traineeship (Water SENSE IGERT)Graduation CeremonyGranite Mountains Desert Research CenterGraphic StandardsGreek Language ProgramGrowl (replaced by R'Web)GSA (Graduate Student Association)GSOE (Graduate School of Education)Guardian Scholars Program            H    Headcount StatisticsHealth Professions Advising CenterHealth Science PartnershipHealthy Communities CenterHealthy Families ProjectHelp @ UCRHerbariumHighlander AthleticsHighlander DayHighlander Early Start AcademyHighlander NewsHighlander OrientationHighlander Orientation for TransfersHighlander Union (HUB)Highlander WelcomeHispanic Studies DepartmentHistory DepartmentHIV/AIDS CommitteeHomecoming (Student Events)Homecoming | Scot FestHonors ProgramHost FamiliesHotels & TravelHousing ServicesHow UCR RanksHuman ResourcesHumanities, Arts, & Social Sciences Program            I    ID CardIDEA (Institute for the Development of Educational Applications)Identity Standards ManualIE Agreement (International Exchange and Linkage Agreement)IEP (International Education Programs)IGERT FellowshipiGradeIIGB (Institute for Integrative Genome Biology)iLearnInland Area Writing ProjectInsect InformationInsect Pests of AnimalsInside UCRInstitute for Integrative Genome BiologyInstitute for Research on World-SystemsInstitute for the Development of Educational Applications (IDEA)Institutional ComputingInstitutional ResearchInstructional ToolsInsurance and Risk ManagementIntegrative Biological Collections CenterIntercollegiate AthleticsInterdisciplinary Programs OfficeInterdisciplinary StudiesInterdisciplinary Water ProjectInternal AuditInternational AffairsInternational Agreements and MOUsInternational Citrus Genome ConsortiumInternational Education Programs (IEP)International Exchange and Linkage AgreementInternational Relations ProgramInternational ScholarsInternational StudentsIROWS (Institute for Research on World-Systems)Italian Language ProgramiTeachiViews Enterprise Workplace Systems            J    Jack and Marilyn Sweeney Granite Mountains Desert Research CenterJames San Jacinto Mountains ReserveJKAJobs, FacultyJobs, StaffJobs, Student            K    Karate ClubKUCR            L    Labor RelationsLabor StudiesLandscape & Refuse ServicesLaser Printer RepairLatin American Studies ProgramLatin Language ProgramLaw and Society ProgramLeadership CenterLearning CenterLearning CenterLearning Management System (LMS)Lesbian Gay Bisexual Transgender Resource CenterLGBTRC (Lesbian Gay Bisexual Transgender Resource Center)Liberal Studies ProgramLibrariesLibrary Book RenewalLibrary Catalog (Scotty)Linguistics ProgramLive ScanLiving the PromiseLMS (Learning Management System)Long Range Development PlanLost and FoundLow Residency Program MFA in Creative Writing and Writing for the Performing Arts (Palm Desert)            M    Mail ServicesMajors ListingMap, CampusMARC U*STAR ProgramMarket at Glen MorMarketingMarxist Studies ProgramMass Spec ServiceMass Spectrometry FacilityMaster of Public Policy ProgramMaterials Science and EngineeringMath ProgramMathematics DepartmentMechanical Engineering DepartmentMedia and Cultural StudiesMedia RelationsMedia ResourcesMedical and Health Careers ProgramMedical Scholars Program (MSP)Medical SchoolMedical School ComplianceMedical School Student Affairs OfficeMEIS (Middle East and Islamic Studies)Memorandum of Understanding (MOU)Mentorship Program for FacultyMESA School ProgramsMESC (Middle Eastern Student Center)MFA for Creative Writing and Writing for the Performing ArtsMFA in Creative Writing and Writing for the Performing Arts (Palm Desert)Microbiology and Plant Pathology, Department of (formerly Plant Pathology and Microbiology)Microbiology Graduate ProgramMiddle East and Islamic Studies (MEIS)Middle Eastern Student Center (MESC)Mini Medical School (MMS)Molecular, Cell, and Systems Biology, Department of (formerly Cell Biology and Neuroscience)Molecular and Translational Medicine CenterMolMed (Center for Molecular and Translational Medicine)Mortgage Origination ProgramMosaic: Art and Literary JournalMotte Rimrock ReserveMOUs (Memorandum of Understanding)Multidisciplinary Financial & Administrative UnitMultimedia TechnologiesMusic DepartmentMyUCRMyUCR (Undergraduate Admissions)            N    National Silverleaf Whitefly Progress ReviewNative American Student ProgramsNatural Reserve SystemNatural Reserve: Motte Rimrock ReserveNematology DepartmentNeuroscience Graduate ProgramNeuroscience ProgramNew Student ConvocationNews BureauNewsroomNo Smoking Policy            O    OCI (On-Campus Interview Program)Office of Academic PersonnelOffice of Alumni EngagementOffice of DevelopmentOffice of Event Management & ProtocolOffice of Interdisciplinary ProgramsOffice of International AffairsOffice of Legal AffairsOffice of Postdoctoral ScholarsOffice of Strategic CommunicationsOffice of Technology CommercializationOffice of the Campus VeterinarianOffice of the ChancellorOffice of the OmbudspersonOffice of the Provost and Executive Vice ChancellorOffice of the RegistrarOffice of the Vice Chancellor for Academic Planning & BudgetOffice of the Vice Chancellor for Student AffairsOffice of the Vice Chancellor for University AdvancementOmbudsmanOn-Campus Interview ProgramOperation Education Scholarship ProgramOral History of UCROrganizational ExcellenceOrganizations, StudentOrientation for FreshmanOutdoor ExcursionsOutlook Web AccessOWA            P    Palm Desert CenterPalm Desert MFA in Creative Writing and Writing for the Performing ArtsPAMIS (Proposal and Award Management Information System)Panda Express (restaurant)Parents AssociationParking ServicesPayroll & Personnel SystemPayroll OfficePC UpgradesPeace and Conflict Studies MinorPeer CounselingPeer Health EducationPEGSC (Program on Political Economy and Global Social Change)People SearchPerforming ArtsPersonnel Policies & Bargaining AgreementsPhilosophy DepartmentPhonebookPhysics and Astronomy DepartmentPipe BandPlacement TestingPlanning (Capital Asset Strategies)Planning and BudgetPlant Pathology Graduate ProgramPlant Transformation Research CenterPolice DepartmentPolicies & Procedures ManualPolitical Science DepartmentPost-Employment BenefitsPostbaccalaureate Premedical ProgramPostdoctoral Scholars OfficePPS (Payroll & Personnel System)Pre-Business Student AffairsPresley Center for Crime and Justice StudiesPress ReleasesPrinting & ReprographicsProcurement ServicesProgram on Political Economy and Global Social ChangeProject Moving ForwardProposal and Award Management Information SystemProspective Graduate StudentsProvost and Executive Vice ChancellorPsychology DepartmentPTRC (Plant Transformation Research Center)Public Policy MajorPublic Policy Masters ProgramPublic Policy SchoolPublic Records RequestsPublic Relations            R    R’CardR'sideR'Space (Staff Portal)R'Web (Student Portal)Radiation Meter CalibrationRadio Station (KUCR)Real Estate ServicesReally Simple SyndicationReceiving & ShippingRecreation Center, gym,Recursos para FamiliasRegents of the University of CaliforniaRegistrarReligious Studies DepartmentRenew booksRequests for Public RecordsResearch and Economic DevelopmentResearch CentersResearch for UndergraduatesResidence Hall NetworkResNet Computer LabRestaurant: The BarnRetirees AssociationRisk ManagementRobert Presley Center for Crime and Justice StudiesRock Climbing WallRSSRussian Language Program            S    Sacramento Mountains ReserveSafety ReportSalinity LaboratorySAM GroupSanta Ana River ReviewSchedule of ClassesScholarships, Fellowships and AwardsSchool of BusinessSchool of MedicineSchool of Medicine Residency ProgramsSchool of Medicine Student Affairs OfficeSchool of Public PolicyScience/Mathematics Initiative (Pre-Teach Advising)Sciences TeachingScot Fest and HomecomingScotmailScotty, Library CatalogScotty’s Convenience StoresSEARCH Family Autism Resource CenterSearch UCRSecurity ReportSelf-Guided ToursSenior Administrative ManagersSenior GiftService EnterprisesSEVIS FeeSexual Harassment OfficeSexual Violence Prevention & ResponseShotokan, UCRSIS Training and AccessSite Licenses (Software)SLLCSMI (Science/Mathematics Initiative)Smoking PolicySociology DepartmentSOE (Graduate School of Education)Software Site LicensesSoutheast Asian Studies Graduate ProgramSouthern California Center of Excellence on Youth Violence PreventionSpace ManagementSpiders InformationStaff and Faculty Assistance ProgramStaff and Faculty HousingStaff AssemblyStaff DirectoryStaff Employment OpportunitiesStaff NewsletterStarbucksStatistical Consulting CollaboratoryStatistics about UCRStatistics DepartmentStatistics on Campus EnrollmentStem Cell CenterStorehouseStrategic Planning 2020Student Affairs Case ManagementStudent Alumni AssociationStudent Business ServicesStudent ClubsStudent Computing ServicesStudent Conduct and Academic Integrity ProgramsStudent Conduct PoliciesStudent DataStudent DirectoryStudent Disability Resource CenterStudent ElectionsStudent Fees, Tuition & ExpensesStudent Health ServicesStudent Information SystemsStudent Judicial AffairsStudent LifeStudent NewspaperStudent OrganizationsStudent Portal (R'WebStudent Recreation CenterStudent Services Fee Advisory CommitteeStudent Special ServicesStudy AbroadSubject A Placement ExamSummer AcademySummer BridgeSummer ClassesSummer SchoolSummer SessionSweeney Art GallerySystemwide Policies & Procedures            T    TAPS (Transportation & Parking Services)Teaching Assistant Mentor ProgramTeaching Careers in Science MathematicsTeaching CredentialsTeam Building Challenge CourseTechnology Commercialization OfficeTelephone DirectoryTelevision StudioThe WellTheatre, Film & Digital Production DepartmentTickets for Fine ArtsTitle IX, Equal Opportunity & Affirmative ActionTobacco FreeTours of CampusTours, VirtualTranscriptsTransfer Admission GuaranteeTransfer OrientationTransportation & Parking Services (TAPS)Travel & HotelsTravel ProceduresTutorial Assistance            U    UC BencomUC Learning CenterUC MEXUS (University of California Institute for Mexico and the United States)UC-Mexico InitiativeUCDC (Washington Center Program)UCOP Policies & ProceduresUCR Alumni AssociationUCR Brand Identity GuidelinesUCR California Museum of PhotographyUCR CardUCR Emeriti & Retirees AssociationsUCR FoundationUCR HealthUCR HerbariumUCR Learning Management System (LMS)UCR LibraryUCR LogoUCR MonogramUCR Pipe BandUCR RankingsUCR Statistical Consulting CollaboratoryUCR TodayUCR: The Magazine of UCRUCRCampusStoreUCRCMP (California Museum of Photography)UECC AmeriCorps ProjectUndeclared CHASS Student AffairsUndergraduate AdmissionsUndergraduate Business ProgramUndergraduate EducationUndergraduate Research, Scholarship and Creative ActivityUnited States Salinity LaboratoryUniversity Advancement OfficeUniversity CommonsUniversity CommunicationsUniversity ExtensionUniversity HonorsUniversity of California Board of RegentsUniversity of California Institute for Mexico and the United States (UC MEXUS)University Writing ProgramUniversity-Eastside Community CooperativeUrban EntomologyUrban Studies Program            V    VCSA (Vice Chancellor for Student Affairs)Veteran's Educational BenefitsVeteran's Financial ServicesVeterans Services at UCRVeterinary EntomologyVice Chancellor for Planning and BudgetVice Chancellor for ResearchVice Chancellor for Student AffairsVice Chancellor for University AdvancementVice Provost of International AffairsVideo Production UnitVirtual ToursVisa Application InformationVisiting International StudentsVisitor's GuideVisitor's InformationVisual Arts Graduate ProgramVisual Resources CollectionVocational RehabilitationVolunteer Opportunities for Employees            W    W2 @ UCRWASC ReaccreditationWashington CenterWater Science and Policy CenterWater SENSE IGERTWeb CoursesWebmail: Rmail and OutlookWelcome EventsWellness Program for Faculty and StaffWestern American Studies ProgramWhistleblower (UCOP)Wilcox, Kim A., ChancellorWireless NetworkWomen's Resource CenterWork Life ProgramWork-Study ProgramWorld Languages ProgramWRCWriting for Performing Arts and Creative Writing MFAWriting for the Performing Arts (Palm Desert)Writing program-Graduate Students            Y    You See UCR in the CommunityYouth Violence PreventionSearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: (951) 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRUniversity Communications             1156 Hinderaker Hall                                     tel: (951) 827-1012                        email: webmaster@ucr.edu  Find UsRelated LinksUCR AdmissionsColleges and SchoolsGraduate DivisionSupport UCRUCR Career CenterUCR HealthUCR JobsUCR NewsFollow US:UC RIverside FacebookUC Riverside TwitterUC Riverside YouTubeUC Riverside InstagramUC Riverside LinkedInPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.SearchCancel"}
{"url": "https://cen.ucr.edu/", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentA to Z ListingCampus MapFind PeopleNewsSkip to main contentMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGSearchBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringUC Riverside Computer Engineering WE ENGINEER EXCELLENCESearchAdmissionsCurriculumCourse CatalogCSE Grad CoursesECE Grad CoursesCurrent StudentsForms and PetitionsStudent AdvisingGraduate Student AssociationHomeAboutOverviewMessage from the DirectorFaculty and StaffWhy UC RiversideABET AccreditationLatest NewsUndergraduateProgram OverviewProspective StudentsAdmissionsTransferring to UCRCurriculumCombined BS+MSCurrent StudentsStudent AdvisingStudent OrganizationsFrequently Asked QuestionsResearchOverviewCompilers and System SoftwareComputer ArchitectureDigital Design and AutomationEmbedded and Real-Time SystemsHigh-Performance ComputingVLSI Circuits and SystemsContactBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringWelcome to the Computer Engineering ProgramNow Accepting Domestic and International Graduate ApplicationsApply NowBreadcrumbRequest More Info  Apply Statement of SolidarityThe faculty of the Computer Engineering Program expresses support to our Black  community, and stands with them against social injustice and racism.  We commit to listening, learning, and striving to create an environment where Black students, faculty, and staff are treated with compassion and respect.  The program wholeheartedly supports the statement and plan of action outlined in the Bourns College of Engineering solidarity statement. Read the statement here.  \"Computing is fueling a revolution that has changed how we live, work, interact and play. Advances continue at an exciting pace with breakthroughs driven by computing at all scales: from massive data being analyzed by warehouse scale computers, providing insights into science and medicine, to embedded devices integrated within our living spaces and infrastructure.” Program Rankings & Industry Outlook                            No. 52                                            Public Engineering College in the U.S. (U.S. News, 2021)                                            No. 1                                            Most Transformative University (Money Magazine, 2020)                                            12th                                            Average Research Area Ranking (CS Rankings)                                            1.4 Million                                            CEN Occupations (Bureau of Labor Statistics, 2018)                                            $117K                                            Median salary for Hardware Engineers (Bureau of Labor Statistics)                                             $105K                                            Median salary for Software Engineers (Bureau of Labor Statistics)                Recent News14 May      CSE Professor Papalexakis received the NSF CAREER award          The award will support work on autonomous tensor analysis.    Read More »aboutCSE Professor Papalexakis received the NSF CAREER award07 May      $3 million award to create a new field of research in one-dimensional quantum materials          Alexander Balandin’s Vannevar Bush Faculty Fellowship will help advance quantum materials for electronics and energy conversion    Read More »about$3 million award to create a new field of research in one-dimensional quantum materials06 May      Alexander Balandin named DoD Vannevar Bush Faculty Fellow          ECE Distinguished Professor Alexander Balandin has been awarded a 2021 Department of Defense (DoD) Vannevar Bush Faculty Fellowship . The five-year, highly competitive fellowship is the DoD’s most prestigious single-investigator award with up to $3 million in funding and “supports new, out-of-the-box ideas where research creativity intersects with the unknown.” Balandin was selected to conduct research in one-dimensional quantum materials. His project aims to create a new comprehensive research field of quantum materials consisting of individual atomic chains of van-der-Waals materials with    Read More »aboutAlexander Balandin named DoD Vannevar Bush Faculty Fellow27 Apr      Jay Farrell named new endowed chair          This July, Jay Farrell will step up to the KA Endowed Chair in Electrical and Computer Engineering at UC Riverside’s Marlan and Rosemary Bourns College of Engineering, or BCOE. The new endowed chair was made possible through a $1 million gift from anonymous donors. As one of seven new endowed chairs established at BCOE during UCR's Living the Promise Campaign, the KA Chair was created to recognize faculty in electrical and computer engineering with distinguished records of research, academic, and professional leadership. See the full story at https://insideucr.ucr.edu/stories/2021/04/23/jay    Read More »aboutJay Farrell named new endowed chair19 Mar      ICPC team advances to North American Division Championship          The UCR team, RGBMoon, will be one of nine teams advancing to the ICPC North American Division Championship.    Read More »aboutICPC team advances to North American Division Championship05 Mar      CSE professor Chengyu Song received the NSF CAREER award          Professor Song received the NSF CAREER award for his work on \"scalable of concolic execution.\"    Read More »aboutCSE professor Chengyu Song received the NSF CAREER award03 Mar      Four ECE professors receive prestigious NSF CAREER Awards          Four ECE faculty members received National Science Foundation (NSF) CAREER Awards this year. This is a remarkable record for a single department. NSF CAREER Awards are given to assistant professors to fund research that is expected to form a firm foundation for a lifetime of leadership in integrating education and research. The four CAREER Award recipients of the ECE department and the projects funded by the award are listed below (ordered by award date). Salman Asif is awarded for a project titled \"Optimized Sensing and Recovery for Computational Imaging\". ECE News: https://www.ece.ucr.edu    Read More »aboutFour ECE professors receive prestigious NSF CAREER Awards25 Feb      Konstantinos Karydis receives NSF CAREER Award on Resilient Dynamic Locomotion of Compliant/Soft Legged Robots for Precision Agriculture          Assistant Professor Konstantinos Karydis receives National Science Foundation (NSF) CAREER award for a project titled \"CAREER: Morphological Computation for Resilient Dynamic Locomotion of Compliant Legged Robots with Application to Precision Agriculture\" The project investigates how compliance embedded into a legged robot can be harnessed to facilitate control and computation, with an eye to enabling efficient and resilient navigation in real agricultural fields. Research activities innovate along three key foundational robotics research directions. 1) Hardware design and dynamic modeling    Read More »aboutKonstantinos Karydis receives NSF CAREER Award on Resilient Dynamic Locomotion of Compliant/Soft Legged Robots for Precision AgricultureMore NewsSearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: (951) 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRComputer Engineering Program C/O Computer Science and Engineering               Winston Chung Hall, Room 351            900 University Ave.             Riverside, CA 92521              tel: (951) 827-5639                 fax: (951) 827-9345         email: contact@cen.ucr.edu Privacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.SearchCancel"}
{"url": "https://www.engr.ucr.edu/", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentMarlan and Rosemary Bourns College of EngineeringBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringSearchUC Riverside Marlan and Rosemary Bourns College of Engineering Celebrating 30 YearsSearchStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership Departments and ProgramsBioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMaster's in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership BioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMaster's in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in Engineering            Calling all 2021 graduates!                We want to hear about your next destination. Share your story to help future cohorts get a glimpse of “what’s next” after graduation.Share Story            Transfer Student Experiences    Learn more            Graduate Students in Charge    Learn more about our graduate programs            The Bourns College of Engineering    Find out how you can givePreviousNextBreadcrumbNews03 Jun      A new water treatment technology could also help Mars explorers          A catalyst that destroys perchlorate in water could clean Martian soil     Read More »aboutA new water treatment technology could also help Mars explorers02 Jun      Poor air quality and warehouses linked to Inland Empire Covid-19 inequities          UC Riverside professors call for intersectional approach to Covid-19 exposure interventions    Read More »aboutPoor air quality and warehouses linked to Inland Empire Covid-19 inequities26 May      $79,000 raised for Professor Emeritus Tom Payne’s 79th birthday          The Thomas H. Payne Scholarship in Computer Science, which supports undergraduate students in computer science, has grown to $79,079, just in time for Professor Payne's 79th birthday.    Read More »about$79,000 raised for Professor Emeritus Tom Payne’s 79th birthday25 May      UC Riverside offers UC system's first master's degree in robotics          Algorithmic bias is one problem the program will tackle    Read More »aboutUC Riverside offers UC system's first master's degree in robotics24 May      Tiny tomatoes could mean big profits for urban agriculture          Grants support continued development of tomatoes for vertical farming    Read More »aboutTiny tomatoes could mean big profits for urban agriculture21 May      Implantable piezoelectric polymer improves controlled release of drugs          Repeated tests showed a similar amount of drug release per activation, confirming robust control of release rate    Read More »aboutImplantable piezoelectric polymer improves controlled release of drugs21 May      Bourns Science and Engineering Day expands STEM outreach to include school districts in Orange County and Los Angeles County          Each year, the Society of Women Engineers (SWE), one of the Marlan and Rosemary Bourns College of Engineering’s (BCOE) more than 20 professional student organizations, hosts Bourns Science and Engineering Day (BSED), formerly called Bourns Engineering Day, a community outreach event introducing STEM to local K-12 students through activities, speakers and lessons. Despite this year’s event moving completely online for the first time, due to the remote setting, many more schools were able to attend in addition to typical attendees from Riverside Unified School District. Students and teachers    Read More »aboutBourns Science and Engineering Day expands STEM outreach to include school districts in Orange County and Los Angeles County18 May      UCR computer scientist earns NSF CAREER award to combat online misinformation and unlock the mystery of black holes          Assistant professor of computer science Evangelos Papalexakis has been awarded the prestigious National Science Foundation (NSF) CAREER Award on autonomous tensor analysis towards actionable insights from raw multi-aspect data, with applications for detecting misinformation online and detecting gravitational waves.    Read More »aboutUCR computer scientist earns NSF CAREER award to combat online misinformation and unlock the mystery of black holes17 May      Nanofiber filter captures almost 100% of coronavirus aerosols          The filter could help curb airborne spread of COVID-19 virus    Read More »aboutNanofiber filter captures almost 100% of coronavirus aerosols11 May      UCR researchers awarded grant to improve technical communication skills in STEM students          Mona Eskandari, assistant professor of mechanical engineering, Mariam Salloum, assistant teaching professor of computer science, and Annika Speer, assistant teaching professor of theater, film and digital production, were awarded a research grant from the Engineering Information Foundation to enhance technical communication in engineering and science. The proposal identified a need for UC Riverside STEM students to receive more practical coaching, delivery evaluation, and presentation feedback. The executed research goals aim to address these needs by creating tangible public speaking training    Read More »aboutUCR researchers awarded grant to improve technical communication skills in STEM students10 May      Electromagnetic levitation whips nanomaterials into shape          Electromagnetic field directs shape formed by gas phase metal molecules    Read More »aboutElectromagnetic levitation whips nanomaterials into shape07 May      $3 million award to create a new field of research in one-dimensional quantum materials          Alexander Balandin’s Vannevar Bush Faculty Fellowship will help advance quantum materials for electronics and energy conversion    Read More »about$3 million award to create a new field of research in one-dimensional quantum materialsMore from news.ucr.edu                            Top 50                                            U.S. public engineering college (U.S. News & World Report)                                            9                                            world-class research centers                                            300,000+                                             square feet of lab and research space                                            133                                            Faculty                                            2,864                                            Undergraduate Students                                            936                                            Graduate Students                SearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: (951) 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRMarlan and Rosemary Bourns College of Engineering             446 Winston Chung Hall            900 University Ave.             Riverside, CA 92521              tel: (951) 827-5190                 fax: (951) 827-3188         email: news@engr.ucr.edu Related LinksBCOE Available Conference Rooms and Technology ResourcesGive to BournsIntranetFaculty ResourcesMarketing ResourcesSystemsFollow US:Visit BCOE's Facebook page (external site: Facebook)Follow BCOE on Twitter (external site: Twitter)Visit BCOE's YouTube channel (external site: YouTube)Visit BCOE's Flickr gallery (external site: Flickr)Subscribe to BCOE News via RSS FeedPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel"}
{"url": "https://highlanderlink.ucr.edu/organization/ewb", "html": "This application requires JavaScript to be enabled."}
{"url": "https://www.engr.ucr.edu/covid-19-information-page", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentMarlan and Rosemary Bourns College of EngineeringBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringSearchUC Riverside Marlan and Rosemary Bourns College of Engineering Celebrating 30 YearsSearchStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership Departments and ProgramsBioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMaster's in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership BioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMaster's in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringBreadcrumbCOVID-19 Information PageCOVID-19 Information PageVIEW CAMPUS STATUSTo learn the latest on campus reopening efforts, visit the Campus Return website.QUESTIONS? Review the BCOE FAQ prior to contacting team members for assistance:BCOE COVID-19 FAQsDaily Wellness Check For UCR employees and students with UCRNetID For visitors without a UCRNetIDTO OBTAIN PPE & FACE COVERINGS: Learn moreI'm searching for guidance on: Instruction ContinuitySpring 2021\tInstruction will be in online or remote formats for the entire quarter.UCR recommendations for instruction continuity: UCR Keep Teaching Website Zoom is the predominant method being suggested\tZoom Security and Best PracticesBCOE has requested Zoom Pro licenses for all BCOE Instructors, check your access at this link using your NetIDView a Zoom tutorial on creating assessments (e.g., exams) through iLearnWorkshop on course delivery via Zoom\t\tCampus-wide online discussion board for questions Faculty resources shared during BCOE Zoom meeting:Poll EverywhereGradescopeiClicker (offering free access due to COVID-19)  Academic PersonnelFor questions about purchasing, please contact your department/program purchasing assistant. They have the most current information on policies and procedures to ensure reimbursements are approved.VPAP Memo: Stop the Clock, and other items (3/20/2020) \tVPAP Walker Memo COVID-19 3 20 2020.pdf Research ContinuityView the latest on research ramp-up guidelines hereFollowing are requirements for all persons visiting campus: 1. Complete the COVID-19 Prevention TrainingTo complete the course, please proceed as follows:\tLog into R'Space (http://www.rspace.ucr.edu)Under Authorized Applications use the link to the UC Learning Center (LMS). This will take you to http://ucrlearning.ucr.edu, where you may also login directly.Click Login Now!On the homepage, click on the Required Training buttonClick the Start button to the left of the activity nameFor tips on eCourses, browser compatibility, and user guides, visit the UCR UC Learning Center support site. If you need assistance accessing the UC Learning Center, please email ucrlearning@ucr.edu. If you have questions about this, please email ehstraining@ucr.edu.2. Obtain permission (see below) either as a research group member for an approved research ramp-up proposal, or for a one-time visit.3. Check in and check out when entering and leaving campus rooms either by scanning the QR codes on the door, or by explicitly selecting room numbers at https://intra.engr.ucr.edu/apps/researchscheduler/user/checkin.phpTo submit a ramp-up proposal to resume on-campus research (research PIs only)https://ehs.ucr.edu/coronavirus/returnTo request a one-time permission to come to campusComplete the COVID-19 Prevention TrainingFill out and submit the form at https://forms.gle/74JfGo23bQ16br2S8Log all entries and exit via QR scanning or at https://intra.engr.ucr.edu/apps/researchscheduler/user/checkin.phpFor instructions click here Continually check the FAQ document for the latest updates on research activities.If you need PPE or face coverings, refer to the June 9 email from EH&S.Research ramp-up efforts will begin June 8 with researchers meeting special requirements as outlined by the Office of Research and Economic Development.Alert your Department LSO activities, equipment or materials requiring monitoring and the necessary frequency. During research ramp-up, safety protocols in a lab will remain in place. (SOP for Working Alone in the Lab)Follow building security requirements in the BCOE Space Use Policy.Check campus COVID-19 information pages frequently. Create a contact sheet for your lab including contact information for the faculty member and a secondary contact. Share this information with your Chair and your LSO.Guidance for asymptomatic on-site personnel who do not have healthcare duties (Posted April 6).Remote AccessAccessing VPNAccessing Remote DesktopTravelhttps://ehs.ucr.edu/coronavirus#information_for_travelersAdministrative Documents - Leave Access, Charging C&G, New Hire Guidance, etc.April 15: COVID-19 related leave and job protection guidance UCR Human Resources COVID-19 Information PageMarch 26: Charging C&G Costs to Federal Sponsored Awards During COVID-19March 20: New Hire GuidanceMarch 26: Leave Guidance for Supervisors of Academic Appointments - UPDATEMarch 19: Leave Guidance for Supervisors of Academic AppointmentsInformation TechnologyBourns EngineeringComputer ScienceSystems reminder: Confirm your computers are up to date with patches and virus/malware protectionBe aware of COVID-19 related computer viruses. Use caution when searching online and verify links are secure prior to clicking on them.\t\tLearn about fake online COVID-19 related information page.April 1 U.S. Secret Service message re: malicious emails  Library ServicesSee the Library information page for available services FacilitiesIf you are on campus and identify an emergency issue, please do the following: call 951-827-4677 AND also email facilities@ucr.edu. As of April 3, EH&S has indicated the following services are continuing but are subject to change at any time:Hazardous waste pick upProcessing of radiation ordersProcessing controlled substances orderIBC, IACUC, and RSC reviewsLaboratory evaluations of any kind will not be scheduled or conducted during this time.April 15: Facilities services that are continuing.  COVID-19 Info and Stats June 9 PPE and face coverings email from EH&SMay 30 research ramp-up notification by the Office of Research and Economic Development.May 9 updated Riverside County OrderApril 2 Order: Extension of school closures to June 19March 31 public health recommendation to cover the faceAmended March 13 Order on school closures by the Public Health Officer of the County of RiversideMarch 16 Order on gatherings by the Public Health Officer of the County of RiversideMarch 13 Order on school closures by the Public Health Officer of the County of Riversidehttps://ehs.ucr.edu/coronavirus/faq_faculty-staffUCOP COVID-19 webpageCDCCDC COVID-19 FAQs QUESTIONS? Review the BCOE FAQ prior to contacting team members for assistance:BCOE COVID-19 FAQsContactsWebsite Suggestions: Jay Farrell, farrell@ece.ucr.eduInstruction: Marko Princevac, marko@engr.ucr.eduResearch: Chinya Ravishankar, ravi@cs.ucr.eduBusiness Operations: Alissa Rackstraw, alissa@engr.ucr.eduInformation Technology: John Cleary, john@engr.ucr.edu, or Victor Hill, vhill@cs.ucr.eduSafety and Facilities: Perry Cheung for safety at pcheung@engr.ucr.edu or Todd Ambriz for facilities at tambriz@engr.ucr.eduSearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: (951) 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRMarlan and Rosemary Bourns College of Engineering             446 Winston Chung Hall            900 University Ave.             Riverside, CA 92521              tel: (951) 827-5190                 fax: (951) 827-3188         email: news@engr.ucr.edu Related LinksBCOE Available Conference Rooms and Technology ResourcesGive to BournsIntranetFaculty ResourcesMarketing ResourcesSystemsFollow US:Visit BCOE's Facebook page (external site: Facebook)Follow BCOE on Twitter (external site: Twitter)Visit BCOE's YouTube channel (external site: YouTube)Visit BCOE's Flickr gallery (external site: Flickr)Subscribe to BCOE News via RSS FeedPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel"}
{"url": "https://ehs.ucr.edu/coronavirus/return", "html": "Skip to main contentPlanning Budget & AdministrationReport a Incident, Injury or Safety ConcernReport a COVID-19 or Public Health ConcernSearchUC Riverside Environmental Health & Safety SearchAbout EH&SOrganizational ChartPrograms & PoliciesStaff DirectoryWho Do I Call?How Can We Help?Programs & PoliciesFood Permit RequestHazardous Waste Pick UpLog into Chemicals, INSPECT, LHAT, & WASTe AppsPersonal Protective Equipment (PPE)Programs & ServicesTrainingCOVID-19 Prevention TrainingReportCOVID-19 ConcernSafety ConcernWork Related Injury/IllnessReport a Incident, Injury or Safety ConcernReport a COVID-19 or Public Health ConcernFace Coverings are required while on campus. Staff/Faculty may request a face covering from EH&S. Students may request a face covering from The Well.×BreadcrumbCoronavirusReopening WorkReturn to Campus protocols As always, your health and well-being are our primary concern. If you are able to do your job effectively without returning to campus, we urge you to talk with your supervisor about continuing to work remotely. As more people get vaccinated and the overall level of new COVID-19 cases declines across the country, we are easing out of the worst public health crisis in a generation. All returns to the workplace must be pre-approved. If you have any questions or concerns about this, please speak with your supervisor. The guidance below applies to all employees who perform duties on campus or UC leased or affiliated properties, unless the facility has expressly provided different instructions. Deans and unit heads will determine which groups are needed to work in person. For those who are approved to return, we are instituting new protocols designed to protect yourself and others. We expect all on-campus workers to abide by the guidelines and directives described below.SupervisorsAuthorization. Provide authorization for each employee to report onsite. Worksite specific plan. Must develop own Worksite Specific Plan . In some cases, the Worksite Specific Plan may be routed to campus oversight committees for review and approval prior to return to campus. Positive case? Refer to the COVID-19 Symptom monitoring and reporting procedures and Response to suspected COVID-19 cases: Guide for Department Leads, Supervisors, Chairs\". Download the quick reference for Supervisors Infographic.For All Returning EmployeesCOVID-19 Prevention Plan Campus GuidanceCOVID-19 Prevention PlanThe campus has developed general guidance, which all employees should review.Prior to your return, your supervisor must share their Worksite Specific Plan with all their employees, and you must review and acknowledge.Download the When To Return guidance infographic. You can also view the Return to Campus Working Group webinars on You Tube. TrainingCOVID-19 PREVENTIONAll employees who plan to be on-site are required to view a training video, \"COVID-19 prevention training\" as required by CDPH/CalOSHA before returning to campus.  Even if you will continue to work remotely, but may need to come to campus occasionally, you must complete this training. This course is accessible in the UC Learning Center. Training WellnessUCR COVID-19 DAILY WELLNESS CHECK SURVEYAll employees who work on-site at a UCR property (owner or leased) must complete a survey prior to reporting for work. If you have symptoms or concerns about exposure, contact your primary care physician and the Wellness Hotline (844) 827-6827. For more information, refer to the COVID-19 Symptom monitoring and reporting procedures (SOP).Daily wellness check  EMPLOYEE WELLNESS PROGRAMThe UCR Wellness Program focuses on promoting awareness and education, motivation for positive behavior changes, and influencing campus practices and policy to support a healthy environment.WellnessFACULTY STAFF ASSISTANCE PROGRAMComPsych will provide GuidanceResources® services whose benefits will provide UCR faculty, staff and their household family members confidential support, resources and information for personal and work-life issues, free of chargeFaculty Staff Assistance ProgramFace coveringIn compliance with the UC order and the California Department of Public Health all individuals on UC property are required to wear face coverings. EH&S is offering face coverings to all campus employees. Submit a request using the button below. Supervisors may request on behalf of their staff using the Face Covering Request form.Face Covering RequestHygiene Disinfectant and sanitizersOrder a disinfectant kit from Facilities services (includes disinfectant, painter’s tape, shop towels, and other items).  Download the Disinfecting Infographic for an at a glace guide.  Disinfectant KiT Request HandwashingAll employees must practice good hygiene by frequently washing your hands with soap and water for 20 seconds or longer. When possible, use soap and water instead of hand sanitizer. Watch this short video on proper handwashing.Custodial A summary of COVID-19 Building Ventilation, Lab Sanitation, Disinfecting and Cleaning schedule as of July 10, 2020 (view the schedule in the link below). Learn more at Facilities Services Campus Return Support Information view details on cleaning schedule.Guidance Document and ScheduleVentilationAll campus buildings that are open to the public during normal times are safe environments. Some of our buildings are much older and have some limitations. Our buildings are designed to provide sufficientair changes based on building activities. We are making a special effort to ensure that all buildings have current filter changes. The information below is how HVAC systems are maintained.Expanded Timeframe: To help with airflow, Facilities Services is expanding the length of time outside airflow will circulate throughout each building.Filtration Maintenance: Building filtration systems are well maintained and have the appropriate level of filters for each building.Air Flow: To accommodate efficient airflow in each building, the most advanced level of filtersare being used based on the building’s air filtration system capabilities.Building VentilationStrict adherence to the public health posters and other visual cues throughout campus and in buildings will reduce transmission risks. Ventilation systems will continue to operate as designed even thoughbuilding occupancy will be reduced. This will further reduce the risk of potential airborne transmission.  While each individual occupant of a campus building will want to make sure these guidelines arefollowed, including limited occupancy, it will be very important to ensure that all the other occupants in that building, at least on that same floor, coordinate to ensure the overall density and guidelines arebeing followed on a collective basis.Transmission Reduction EffortsAccording to the World Health Organization (WHO) and the Centers for Disease Control (CDC), the COVID-19 virus appears to spread human-to-human through respiratory droplets coming from an infected person. Based on public health guidance, the key transmission reduction factors include:social distancing,limiting occupancy,practicing good personal hygiene, andutilizing face coveringsAs part of the public health guidance, Facilities Services will disinfect high-touch areas including elevators, door handles, common areas and restrooms. We have made disinfecting kits available to departments and hand sanitizing stations are located at the entrance of each building. A map locating sanitizing stations can be viewed by clicking here. HVAC ventilation FAQ'sResources and SOPsSignageThe campus has developed standard signage and postings for building entrances, exits, stairs, elevators and more. Download and post signage through your work areas.COVID-19 Campus SignaGEThe following posters are installed throughout campus:Keep yourself healthy Face covering requiredElevator (1 person maximum)Wait here (footprints)Do not use (this area is closed)To obtain additional signs complete the COVID-19 signage request.Standard Operating Procedures (SOP)General Areas: Office SpaceGeneral Area/Office Space Disinfection SOPLaboratories\tLaboratory/Research Space Disinfection SOPFacilities\tDisinfection response plan SOPShared VehicleTo reduce the spread of COVID-19, avoid sharing UCR vehicles whenever possible. Employees may share vehicles only if approved in advance and in writing by a supervisor. Review this Shared Vehicle Guidance for details.Visitors & ContractorsWe recognize that visitors, contractors, vendors and other non-UCR personnel may need to come to campus.Contract employees working through third party employers must follow all campus protocols.Contract employees are required to continue following all Non-Pharmaceutical Interventions (NPI), such as masking, physical distancing, hygiene, daily wellness checks until further noticeContract units must complete and submit a copy of their WSSP or provide their employer’s equivalent documentation to ehspublichealth@ucr.eduNon-UCR affiliated individuals coming to campus for essential work must abide by visitor guidelines. Non-UCR Affiliate information TravelEmployees who have travelled domestically or internationally, whether for personal or business purposes should refer to the following guidelines and restrictions regarding travel. Travel GuidelinesQuick LinksCampus ReturnHotlineUCR Daily Wellness Check SurveyHuman Resources COVID-19 ResourcesStudent Health ServicesCampus Emergency StatusKeep TeachingKeep LearningKeep WorkingKeep ResearchingCoronavirus ResourcesFace Covering RequestResearch Ramp UpSearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: (951) 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRUniversity of California, Riverside             Environmental Health & Safety             900 University Ave.             Riverside, CA 92521              tel: (951) 827-5528                 fax: (951) 827-5122         email: ehs@ucr.edu  Find UsRelated LinksCoronavirus Resources & UpdatesCustomer Service Satisfaction Survey for EH&SEmergency ManagementFire & Life SafetyRisk & Safety Solutions Web Application Log InRisk ManagementUC Police DepartmentUC Risk & Safety TrainingPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel"}
{"url": "https://forms.gle/MuniHhmD3mvPLZH77", "html": "Request for short, one-time visit to BCOE facilitiesThis form is only for one-time requests to come to campus. To submit research ramp-up proposals, please go to https://forms.gle/jh7XKvEcuDpK7gyK7.* RequiredEmail *Your emailYour name *Your answerOn-campus presence requires you to complete the COVID-19 training at the UC Learning Center (LMS). Have you completed this training? *YesNoWill you ensure that before coming to campus, you will complete the UCR Symptom Monitoring Survey at https://ucriverside.az1.qualtrics.com/jfe/form/SV_cZwHeZMQU2F6Tsx?  If you are requesting permission for an external visitor, they must complete the Symptom Monitoring Survey at https://ucriverside.az1.qualtrics.com/jfe/form/SV_00Lu8W4mqmIdsqx. *YesNoNextNever submit passwords through Google Forms.This content is neither created nor endorsed by Google. Report Abuse - Terms of Service - Privacy Policy Forms  "}
