[{"id": 1, "url": "https://www.engr.ucr.edu/", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentMarlan and Rosemary Bourns College of EngineeringBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringSearchUC Riverside Marlan and Rosemary Bourns College of Engineering Celebrating 30 YearsSearchStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership Departments and ProgramsBioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMasters in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership BioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMasters in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in Engineering            Calling all 2021 graduates!                We want to hear about your next destination. Share your story to help future cohorts get a glimpse of “what’s next” after graduation.Share Story            Transfer Student Experiences    Learn more            Graduate Students in Charge    Learn more about our graduate programs            The Bourns College of Engineering    Find out how you can givePreviousNextBreadcrumbNews03 Jun      A new water treatment technology could also help Mars explorers          A catalyst that destroys perchlorate in water could clean Martian soil     Read More »aboutA new water treatment technology could also help Mars explorers02 Jun      Poor air quality and warehouses linked to Inland Empire Covid-19 inequities          UC Riverside professors call for intersectional approach to Covid-19 exposure interventions    Read More »aboutPoor air quality and warehouses linked to Inland Empire Covid-19 inequities26 May      $79,000 raised for Professor Emeritus Tom Payne’s 79th birthday          The Thomas H. Payne Scholarship in Computer Science, which supports undergraduate students in computer science, has grown to $79,079, just in time for Professor Paynes 79th birthday.    Read More »about$79,000 raised for Professor Emeritus Tom Payne’s 79th birthday25 May      UC Riverside offers UC systems first masters degree in robotics          Algorithmic bias is one problem the program will tackle    Read More »aboutUC Riverside offers UC systems first masters degree in robotics24 May      Tiny tomatoes could mean big profits for urban agriculture          Grants support continued development of tomatoes for vertical farming    Read More »aboutTiny tomatoes could mean big profits for urban agriculture21 May      Implantable piezoelectric polymer improves controlled release of drugs          Repeated tests showed a similar amount of drug release per activation, confirming robust control of release rate    Read More »aboutImplantable piezoelectric polymer improves controlled release of drugs21 May      Bourns Science and Engineering Day expands STEM outreach to include school districts in Orange County and Los Angeles County          Each year, the Society of Women Engineers SWE, one of the Marlan and Rosemary Bourns College of Engineering’s BCOE more than 20 professional student organizations, hosts Bourns Science and Engineering Day BSED, formerly called Bourns Engineering Day, a community outreach event introducing STEM to local K-12 students through activities, speakers and lessons. Despite this year’s event moving completely online for the first time, due to the remote setting, many more schools were able to attend in addition to typical attendees from Riverside Unified School District. Students and teachers    Read More »aboutBourns Science and Engineering Day expands STEM outreach to include school districts in Orange County and Los Angeles County18 May      UCR computer scientist earns NSF CAREER award to combat online misinformation and unlock the mystery of black holes          Assistant professor of computer science Evangelos Papalexakis has been awarded the prestigious National Science Foundation NSF CAREER Award on autonomous tensor analysis towards actionable insights from raw multi-aspect data, with applications for detecting misinformation online and detecting gravitational waves.    Read More »aboutUCR computer scientist earns NSF CAREER award to combat online misinformation and unlock the mystery of black holes17 May      Nanofiber filter captures almost 100% of coronavirus aerosols          The filter could help curb airborne spread of COVID-19 virus    Read More »aboutNanofiber filter captures almost 100% of coronavirus aerosols11 May      UCR researchers awarded grant to improve technical communication skills in STEM students          Mona Eskandari, assistant professor of mechanical engineering, Mariam Salloum, assistant teaching professor of computer science, and Annika Speer, assistant teaching professor of theater, film and digital production, were awarded a research grant from the Engineering Information Foundation to enhance technical communication in engineering and science. The proposal identified a need for UC Riverside STEM students to receive more practical coaching, delivery evaluation, and presentation feedback. The executed research goals aim to address these needs by creating tangible public speaking training    Read More »aboutUCR researchers awarded grant to improve technical communication skills in STEM students10 May      Electromagnetic levitation whips nanomaterials into shape          Electromagnetic field directs shape formed by gas phase metal molecules    Read More »aboutElectromagnetic levitation whips nanomaterials into shape07 May      $3 million award to create a new field of research in one-dimensional quantum materials          Alexander Balandin’s Vannevar Bush Faculty Fellowship will help advance quantum materials for electronics and energy conversion    Read More »about$3 million award to create a new field of research in one-dimensional quantum materialsMore from news.ucr.edu                            Top 50                                            U.S. public engineering college U.S. News & World Report                                            9                                            world-class research centers                                            300,000+                                             square feet of lab and research space                                            133                                            Faculty                                            2,864                                            Undergraduate Students                                            936                                            Graduate Students                SearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: 951 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRMarlan and Rosemary Bourns College of Engineering             446 Winston Chung Hall            900 University Ave.             Riverside, CA 92521              tel: 951 827-5190                 fax: 951 827-3188         email: news@engr.ucr.edu Related LinksBCOE Available Conference Rooms and Technology ResourcesGive to BournsIntranetFaculty ResourcesMarketing ResourcesSystemsFollow US:Visit BCOEs Facebook page external site: FacebookFollow BCOE on Twitter external site: TwitterVisit BCOEs YouTube channel external site: YouTubeVisit BCOEs Flickr gallery external site: FlickrSubscribe to BCOE News via RSS FeedPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel"}, {"id": 2, "url": "https://cen.ucr.edu/", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentA to Z ListingCampus MapFind PeopleNewsSkip to main contentMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGSearchBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringUC Riverside Computer Engineering WE ENGINEER EXCELLENCESearchAdmissionsCurriculumCourse CatalogCSE Grad CoursesECE Grad CoursesCurrent StudentsForms and PetitionsStudent AdvisingGraduate Student AssociationHomeAboutOverviewMessage from the DirectorFaculty and StaffWhy UC RiversideABET AccreditationLatest NewsUndergraduateProgram OverviewProspective StudentsAdmissionsTransferring to UCRCurriculumCombined BS+MSCurrent StudentsStudent AdvisingStudent OrganizationsFrequently Asked QuestionsResearchOverviewCompilers and System SoftwareComputer ArchitectureDigital Design and AutomationEmbedded and Real-Time SystemsHigh-Performance ComputingVLSI Circuits and SystemsContactBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringWelcome to the Computer Engineering ProgramNow Accepting Domestic and International Graduate ApplicationsApply NowBreadcrumbRequest More Info  Apply Statement of SolidarityThe faculty of the Computer Engineering Program expresses support to our Black  community, and stands with them against social injustice and racism.  We commit to listening, learning, and striving to create an environment where Black students, faculty, and staff are treated with compassion and respect.  The program wholeheartedly supports the statement and plan of action outlined in the Bourns College of Engineering solidarity statement. Read the statement here.  \"Computing is fueling a revolution that has changed how we live, work, interact and play. Advances continue at an exciting pace with breakthroughs driven by computing at all scales: from massive data being analyzed by warehouse scale computers, providing insights into science and medicine, to embedded devices integrated within our living spaces and infrastructure.” Program Rankings & Industry Outlook                            No. 52                                            Public Engineering College in the U.S. U.S. News, 2021                                            No. 1                                            Most Transformative University Money Magazine, 2020                                            12th                                            Average Research Area Ranking CS Rankings                                            1.4 Million                                            CEN Occupations Bureau of Labor Statistics, 2018                                            $117K                                            Median salary for Hardware Engineers Bureau of Labor Statistics                                             $105K                                            Median salary for Software Engineers Bureau of Labor Statistics                Recent News07 May      $3 million award to create a new field of research in one-dimensional quantum materials          Alexander Balandin’s Vannevar Bush Faculty Fellowship will help advance quantum materials for electronics and energy conversion    Read More »about$3 million award to create a new field of research in one-dimensional quantum materials06 May      Alexander Balandin named DoD Vannevar Bush Faculty Fellow          ECE Distinguished Professor Alexander Balandin has been awarded a 2021 Department of Defense DoD Vannevar Bush Faculty Fellowship . The five-year, highly competitive fellowship is the DoD’s most prestigious single-investigator award with up to $3 million in funding and “supports new, out-of-the-box ideas where research creativity intersects with the unknown.” Balandin was selected to conduct research in one-dimensional quantum materials. His project aims to create a new comprehensive research field of quantum materials consisting of individual atomic chains of van-der-Waals materials with    Read More »aboutAlexander Balandin named DoD Vannevar Bush Faculty Fellow27 Apr      Jay Farrell named new endowed chair          This July, Jay Farrell will step up to the KA Endowed Chair in Electrical and Computer Engineering at UC Riverside’s Marlan and Rosemary Bourns College of Engineering, or BCOE. The new endowed chair was made possible through a $1 million gift from anonymous donors. As one of seven new endowed chairs established at BCOE during UCRs Living the Promise Campaign, the KA Chair was created to recognize faculty in electrical and computer engineering with distinguished records of research, academic, and professional leadership. See the full story at https://insideucr.ucr.edu/stories/2021/04/23/jay    Read More »aboutJay Farrell named new endowed chair03 Mar      Four ECE professors receive prestigious NSF CAREER Awards          Four ECE faculty members received National Science Foundation NSF CAREER Awards this year. This is a remarkable record for a single department. NSF CAREER Awards are given to assistant professors to fund research that is expected to form a firm foundation for a lifetime of leadership in integrating education and research. The four CAREER Award recipients of the ECE department and the projects funded by the award are listed below ordered by award date. Salman Asif is awarded for a project titled \"Optimized Sensing and Recovery for Computational Imaging\". ECE News: https://www.ece.ucr.edu    Read More »aboutFour ECE professors receive prestigious NSF CAREER Awards25 Feb      Daniel Wong receives NSF CAREER Award on Efficient Accelerated Cloud Data Centers          Assistant Professor Daniel Wong receives National Science Foundation NSF CAREER award for a project titled \"CAREER: Towards Efficient Accelerated Cloud Data Centers.” Emerging large-scale compute-intensive applications, such as machine learning and big data analytics, have led to the wide-spread adoption of compute accelerators, such as Graphical Processing Units GPUs, in cloud data centers. However, the existing cloud management software stack introduces many layers of abstraction that strip away application characteristics and hardware architectural details leading to inefficient and    Read More »aboutDaniel Wong receives NSF CAREER Award on Efficient Accelerated Cloud Data Centers25 Feb      Konstantinos Karydis receives NSF CAREER Award on Resilient Dynamic Locomotion of Compliant/Soft Legged Robots for Precision Agriculture          Assistant Professor Konstantinos Karydis receives National Science Foundation NSF CAREER award for a project titled \"CAREER: Morphological Computation for Resilient Dynamic Locomotion of Compliant Legged Robots with Application to Precision Agriculture\" The project investigates how compliance embedded into a legged robot can be harnessed to facilitate control and computation, with an eye to enabling efficient and resilient navigation in real agricultural fields. Research activities innovate along three key foundational robotics research directions. 1 Hardware design and dynamic modeling    Read More »aboutKonstantinos Karydis receives NSF CAREER Award on Resilient Dynamic Locomotion of Compliant/Soft Legged Robots for Precision Agriculture22 Feb      Polymer film protects from electromagnetic radiation, signal interference          The breakthrough combines excellent electromagnetic shielding with ease of manufacture and electrical isolation     Read More »aboutPolymer film protects from electromagnetic radiation, signal interference03 Feb      How to burst your bubble: broadening your social media horizons          A computer scientist explains how our online behavior drives us into echo chambers    Read More »aboutHow to burst your bubble: broadening your social media horizonsMore NewsSearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: 951 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRComputer Engineering Program C/O Computer Science and Engineering               Winston Chung Hall, Room 351            900 University Ave.             Riverside, CA 92521              tel: 951 827-5639                 fax: 951 827-9345         email: contact@cen.ucr.edu Privacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.SearchCancel"}, {"id": 3, "url": "https://highlanderlink.ucr.edu/organization/ewb", "html": "This application requires JavaScript to be enabled."}, {"id": 4, "url": "https://www.ee.ucr.edu/", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentA to Z ListingCampus MapFind PeopleNewsSkip to main contentMarlan and Rosemary Bourns College of EngineeringSearchBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringUC Riverside Department of Electrical and Computer Engineering We Engineer ExcellenceSearchUndergraduateProspectiveApply OnlineCurrentAdvisingNew Student OrientationProgram Requirements    Focus AreasProgramsElectrical EngineeringComputer EngineeringMaterials Science and EngineeringCoursesStudent ProjectsABETFinancial InformationGraduateProgram OverviewAdmissionsOverviewDomestic ApplicantsInternational ApplicantsECE UCR DifferenceRequest InfoApplyFAQContinuingAcademicsOverviewBS+MSMSEECENPhDResourcesGraduate Student ManualNew Student InformationGraduate Student Association GSACoursesPeopleFacultyCooperating FacultyResearch FacultyLecturersAdjunct FacultyStaffResearchAreas of ResearchOverviewCommunications, Signal Processing, and NetworkingComputer EngineeringControl and RoboticsIntelligent SystemsNanotechnology, Advanced Materials, and DevicesPower Systems and Smart GridResearch LabsOverviewCommunications, Signal Processing, and NetworkingComputer EngineeringControl and RoboticsIntelligent SystemsNanotechnology, Advanced Materials, and DevicesPower Systems and Smart GridResearch CentersAboutMessage from the ChairMission StatementHistoryFacts and FiguresBoard of AdvisorsEngagementStudent Clubs and OrganizationsOutreachStem Summer CampEventsNewsResearch HighlightsGivingOverviewGiving OpportunitiesEmploymentBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in Engineering            Fall 2021 Applicants: Its not too late!                September 1st – Deadline to submit a complete application for domestic applicants    APPLY HERE            New Master of Science Degree in Robotics                The program could be available as early as Fall 2021    Learn More            GAANN Fellowship for Domestic PhD Students                Multiple funded PhD research positions available. Join a diverse student body working in cutting-edge research!    Learn MorePreviousNextBreadcrumbDepartment News04 JunTseng’s team received outstanding paper award in RTAS 2021            Hung-Wei Tseng, an assistant professor of electrical and computer engineering at UC Riverside, and his former undergraduate student researchers. Alec Rohloff, Zackary Allen, Joshua Okrend and Chengyi Nie as well as a high-school student intern, Kung-Min Lin, received the outstanding...    Read More »More about the Article: Tseng’s team received outstanding paper award in RTAS 202125 MayProfessor Abu-Ghazaleh Receives Doctoral Dissertation Faculty Award            Professor Nael Abu-Ghazaleh, jointly appointed to ECE and CSE, is selected as the recipient of this year’s Doctoral Dissertation Faculty Award. Doctoral Dissertation Faculty Award is a campus-wide award to faculty who provide excellent mentorship and support of their graduate...    Read More »More about the Article: Professor Abu-Ghazaleh Receives Doctoral Dissertation Faculty Award06 MayAlexander Balandin named DoD Vannevar Bush Faculty Fellow            ECE Distinguished Professor Alexander Balandin has been awarded a 2021 Department of Defense DoD Vannevar Bush Faculty Fellowship . The five-year, highly competitive fellowship is the DoD’s most prestigious single-investigator award with up to $3 million in funding and “supports...    Read More »More about the Article: Alexander Balandin named DoD Vannevar Bush Faculty Fellow27 AprJay Farrell named new endowed chair            This July, Jay Farrell will step up to the KA Endowed Chair in Electrical and Computer Engineering at UC Riverside’s Marlan and Rosemary Bourns College of Engineering, or BCOE. The new endowed chair was made possible through a $1 million...    Read More »More about the Article: Jay Farrell named new endowed chairMore NewsResearch HighlightsJune 04, 2021Exploring Full Potential of Emerging Hardware TechnologiesJune 02, 2021Spin-mediated Thermal Transport in Quantum MaterialsMay 08, 2021Privacy-Aware Large-Scale Machine LearningSeptember 29, 2020Electromagnetic Interference Shielding with Graphene Composites for 5G-and-Beyond Communication TechnologiesAugust 28, 2020Discovering new type of vulnerabilities affecting Graphical Processing UnitsAugust 11, 2020Upcycling plastic waste toward sustainable energy storageApril 15, 2020Towards Terahertz Electronic DevicesJanuary 24, 2020Tseng and his student’s paper is chosen for IEEE Micro Top Picks 2020December 11, 2019Quantum Supremacy paper coauthored by KorotkovMore Highlights Upcoming Events        Colloquium by Fred Chong    May 24, 2021 @ 11:00 am        Over Zoom            Title: \"Resource-Efficient Quantum Computing by Breaking Abstractions\"      View Event »More About the Event:Colloquium by Fred Chong        Colloquium by Michael Hamilton    May 17, 2021 @ 11:00 am        Over Zoom            Title: \"Superconducting Interconnect Technologies for Cryogenic and Quantum Systems\"      View Event »More About the Event:Colloquium by Michael Hamilton        Distinguished Colloquium by Yan Solihin    May 10, 2021 @ 11:00 am        Over Zoom            Title: \"Security Challenges and Approaches with Persistent Memory\"      View Event »More About the Event:Distinguished Colloquium by Yan Solihin        Colloquium by Milad Hashemi    May 03, 2021 @ 11:00 am        Over Zoom            Title: \"Automating Computer Architecture Using Machine Learning\"      View Event »More About the Event:Colloquium by Milad HashemiAll EventsFinal DefensesFinal Defense of Dissertation: Hao Xin June 07, 2021 |             Hao Xin      Final Defense of Dissertation: Xinyue KanJune 04, 2021 |             Xinyue Kan     Final Defense of Dissertation: Sajjad BahramiJune 03, 2021 |             Sajjad Bahrami     Final Defense of Dissertation: Amirmahdi MohammadzadehMay 28, 2021 |             Amirmahdi Mohammadzadeh     Final Defense of Dissertation: Shuo WuMay 28, 2021 |             Shuo Wu      Final Defense of Dissertation: Shan SunMay 25, 2021 |             Shan Sun     More Final DefensesTwitter FeedTweets by ucr_ece View on TwitterAt a Glance                            $10M+                                            New research grants in FY2019/20                                            #31                                            US News 2020 Global University Rankings                                            200+, 450+                                            Total graduate and undergraduate students                                             14, 13                                            Fellows of IEEE, NAI and other organizations; NSF CAREER and Young Investigator Awards                SearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: 951 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRDepartment of Electrical and Computer Engineering             900 University Avenue            Suite 343 Winston Chung Hall             Riverside, CA 92521              tel: 951 827-2484                 fax: 951 827-2425         email: ecegradoffice@ece.ucr.edu Related LinksBCOE Available Conference Rooms and Technology ResourcesLicense Bourns TechnologyGive to BournsAdministrative SuiteIntranetSystemsClosure Days New Year’s DayMartin Luther King, Jr. DayPresident’s DayCesar Chavez DayMemorial DayIndependence DayLabor DayVeteran’s DayThanksgiving HolidayWinter Break\t Follow US:Visit BCOEs Facebook page external site: FacebookFollow UCR ECE on Twitter external site: TwitterVisit BCOEs YouTube channel external site: YouTubeFollow UCR on Instagram external site: InstagramFollow UCR ECE on LinkedIn external site: LinkedInVisit BCOEs Flickr gallery external site: FlickrSubscribe to ECE news via RSSPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel"}, {"id": 5, "url": "https://www1.cs.ucr.edu/", "html": "We Engineer ExcellenceCOVID-19 UpdatesRead MoreYour browser does not support the video tag.Creating the next generation of engineers, researchers, and scholarsNewsCSE Professor Received Doctoral Dissertation Faculty Award5/21/2021Prof. Nael Abu-Ghazaleh received the Doctoral Dissertation Faculty Award which is a campus-wide award to faculty who provide excellent mentorship and support of their graduate studentsRead MoreCSE Professor Papalexakis received the NSF CAREER award5/14/2021The award will support work on autonomous tensor analysis.Read MoreICPC team advances to North American Division Championship3/19/2021The UCR team, RGBMoon, will be one of nine teams advancing to the ICPC North American Division Championship.Read MoreAll NewsEventsUCR is in the Pacific time zone, but event times shown below are adjusted to the time zone of your device.TodayBackNext06/04/2021 — 09/02/2021MonthWeekDayAgendaThere are no events in this range.All EventsDistinguished Lecture SeriesUCR LibraryCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRDepartment of Computer Science and EngineeringWinston Chung Hall, Room 351Bourns College of Engineering Riverside, CA 92521-0429Tel: 951 827-5639Fax: 951 827-9345Email: contact@cs.ucr.eduRelated LinksDepartment IntranetTwitterFacebookPrivacy PolicyTerms and Conditions© 2019 Regents of the University of California"}, {"id": 6, "url": "https://student.engr.ucr.edu/majors", "html": "Skip to main contentMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringSearchUC Riverside Engineering Student Affairs WE ENGINEER EXCELLENCESearchPeopleAdvisor and Student PartnershipAcademic Advisor AvailabilityE-Mailing an Academic AdvisorProcesses and PoliciesOnline Advising PolicyEnrollment AssistanceOnline PetitionAcademic StandingDouble MajorsS/NC PolicyGraduation & CommencementMaximum UnitsPrivacy FERPAReadmissionRepeat RulesWithdrawalRequirementsMajorsBreadth RequirementsApproved Course ListCriteria/RestrictionsSearch for CoursesMajor ChangesCOMBINED BS + MS PROGRAMSComputer Science MinorTransferable CoursesAP/IB CreditComputer RequirementStudent SuccessVideo Advising ResourcesEngineering Learning CommunitiesEnginuity HallSuccess StrategiesTransfer TransitionProfessional OrganizationsScholarship OpportunitiesBlack Student ExperienceStudy AbroadFreshmen/Transfer Orientation 2021Remote Learning TipsBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringBCOE Advisors are available for students!Click here for information and resources during the COVID-19 Campus Closure!×BreadcrumbMajorsMajorsDegree RequirementsYou must complete the major requirements, breadth requirements, and university requirements to satisfy degree requirements for the B.S. in your major.Quick LinksCOMBINED BS + MS PROGRAMSUC/CSU Transferable CoursesMajor RequirementsSee General Course Catalog. Select the catalog \"year\" that lists the requirements you plan to follow. You may choose a catalog from an academic year in which you were enrolled full-time anywhere at least one term. You may also choose the catalog year in effect the academic year of your graduation.Current Catalog: UCR General CatalogArchived Catalogs: UCR General Catalog ArchivesSuggested Course Plans and Technical ElectivesThe suggested course plan serves three purposes:Presents the departments course offering intentions, per term, for a particular catalog year;Offers students a plan towards satisfying all degree requirements on a term by term basis consistent with the departments course offering intentions;Lists technical electives in effect for a particular catalog year.Suggested Course PlansBioengineeringComputer Science with Business ApplicationsChemical Engineering Nanotechnology BiochemicalComputer EngineeringComputer ScienceData ScienceElectrical EngineeringEnvironmental EngineeringMaterials Science and EngineeringMechanical EngineeringBreadth RequirementsIn order to graduate, engineering students must satisfy the breadth requirements as determined by the Executive Committee of the Bourns College of Engineering. Students may satisfy the breadth requirements with any course on the BCOE list of approved breadth courses. Students may choose courses from any approved breadth list in effect while enrolled full-time at least one term in an academic year.To provide depth in satisfying breadth in the humanities and social sciences, courses must meet the following criteria:At least two of the humanities and social science courses must be upper division.At least two courses must be from the same subject area, either humanities or social sciences, with at least one being an upper division course.Past Suggested Course Plans            Bioengineering    2019201820172016            Chemical Engineering    2019: CHEN, BCEN, NANO2018: CHEN, BCEN, NANO2017: CHEN, BCEN, NANO2016: CHEN, BCEN, NANO            Computer Engineering    2019201820172016            Computer Science    2019201820172016            Computer Science with Business Applications    2019201820172016            Electrical Engineering    2019201820172016            Environmental Engineering    2019201820172016            Materials Science & Engineering    2019201820172016            Mechanical Engineering    2019201820172016SearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: 951 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRBCOE  STUDENT AFFAIRS             Skye Hall 310            University of California, Riverside             Riverside, CA 92521-0429              tel: 951 827-3647                 fax: 951827-2822         email: bcoeadvising@engr.ucr.edu  Find UsRelated LinksBourns College Of EngineeringCareer CenterFinancial AidGraduate StudiesPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel"}, {"id": 7, "url": "https://engineering.uci.edu/dept/cee", "html": "Skip to main content              UNIVERSITY OF CALIFORNIA, IRVINE            MenuSearch formSearch            Current Students                      Undergraduate                      Academic Advising & Support                      Academic Planning & Resources                      Academic Opportunities & Research                      Financial Support                      Online Forms & Resources                      Calendar & Deadlines                      Career Resources                      Clubs and Organizations                      Frequently Asked Questions                      Contact Us                      Graduate                      Advisors & Coordinators                      Graduate Studies Committee                      Curricular Practical Training                      Deadlines                      New Graduate Students                      Ph.D. Milestones                      Policies & Procedures                      Resources                      Financial Support                      Teaching Assistant FAQs                      ZotChat                      Contact Us                      Additional Resources                      Engineering Student Study/Meeting Space                      Free Software                      Departments                      Biomedical Engineering                      Message From Chair                      About                      Facts & Figures                      Undergraduate                      Graduate                      Research                      Faculty & Staff                      Academic Employment                      Corporate                      Dept Events                      Dept News                      Discovery News                      Student Testimonials                      Give to BME                      Contact Us                      Chemical and Biomolecular Engineering                      Message From Chair                      About                      Facts & Figures                      Undergraduate                      Graduate                      Research                      Faculty & Staff                      Academic Employment                      Seminar Series                      Dept Events                      Dept News                      Contact Us                      Civil and Environmental Engineering                      Message From Chair                      Mission                      Facts & Figures                      Undergraduate                      Graduate                      Career Opportunities                      Research                      Faculty & Staff                      Academic Employment                      CEE Affiliates                      Alumni                      Dept Events                      Dept News                      E-Newsletter                      Give to CEE                      Contact Us                      Electrical Engineering and Computer Science                      About                      Academics                      People                      Research                      News & Events                      Materials Science and Engineering                      Message From Chair                      About                      Facts & Figures                      Undergraduate                      Graduate                      Research                      Faculty & Staff                      Academic Employment                      MSE 298 Seminars                      Dept Events                      Dept News                      Contact Us                      Mechanical and Aerospace Engineering                      Message From Chair                      About                      Facts & Figures                      Undergraduate                      Graduate                      Research                      Faculty & Staff                      Academic Employment                      E-Newsletter                      MAE Seminars                      Corporate Affiliates                      Intranet                      Contact Us                      Interdisciplinary Graduate Programs                      Computational Science Joint Program                      Master of Embedded and Cyber Physical Systems                      Master of Engineering                      Materials and Manufacturing Technology                      MMT Faculty                      MMT Forms                      Directory                      All faculty & staff                      Deans Office                      Development and External Relations                      Student Affairs                      Engineering Research Management                      UC Irvine Directory                      Faculty & Staff                      Personnel                      Academic                      Staff                      Engineering Research Management                      Pre-Award                      Pre-Award Proposal Request                      Pre-Award Forms and Proposal Templates                      Post-Award                      ERM Post-Award Assignments                      Post-Award Forms                      Early Career Opportunities                      Contact Us                      Purchasing & Reimbursement                      Purchasing Requests                      Reimbursements                      Purchasing & Reimbursement Mission Statement                      Business Meetings/ Entertainment Guidelines                      Forms                      Service Agreements                      Travel Guidelines                      UC Policies & Procedures                      Administrative Staff                      Deans Office                      Chief Administrative Officers                      Personnel Unit                      Finance Unit                      Purchasing Unit                      Computing Unit                      Facilities Unit                      Curriculum, Analytical Studies, & Accreditation CASA                      Communications Office                      Development and External Relations Office                      Outreach Unit                      Engineering Research Management                      Computing Support                      Helpdesk                      Office of Information Technology                      Faculty Websites                      Computer Labs & Laptops                      Facilities Support                      Engineering Facilities Request Form                      Safety Procedures                      zotALERT                      Campus Evacuation Zones                      Zone Crew                      Environmental Health & Safety                      UCI Police Department                      Helpful Links                      Org Charts                      At Your Service                      Zot! Portal                      FAQs for Engineering Instructors                      Spring Awards                      Alumni & Friends                      Alumni Spotlight                      Donor News                      Hall of Fame                      #ANTEATERENGINEER                      Ways to Give                      Make a Gift Online                      Brilliant Future: Case for Support                      Join the Deans Circle                      UCI Engineering Alumni Society                      UC Irvine Alumni Association                      Contact Us                      About                      Interim Deans Message                      Strategic Plan                      Facts and Figures                      Henry Samueli                      School Leadership                      Engineering Leadership Council                      Accreditation                      Orange County                      Employment                      Faculty Positions                      Lecturer Positions                      Postdoctoral Scholar Positions                      Research Positions                      Open Samueli School of Engineering Staff Positions                      Visit Us                      Driving Directions                      Parking and Maps                      Walking Map                      UCI Campus Maps                      Got Questions?                      Admissions                      Undergraduate                      Enrollment and Degrees Awarded                      Why UCI?                      How to Apply                      Prospective Students                      Newly Admitted                      Freshmen                      Transfers                      Majors and Minors Offered                      Frequently Asked Questions                      Contact Us                      Graduate                      Programs and Concentrations                      How to Apply                      Accelerated Status Program                      International Fellowships                      Meet Us on the Road                      Frequently Asked Questions                      PhD and Masters Inquiry Form                      Contact Us                      Research                      Engineering Phase 3 Research Restart                      Research Support / ERM                      Engineering Coronavirus Solutions                      Message from the Associate Dean                      Research Thrusts                      Energy and Sustainability                      Communications and Information Technology                      Advanced Manufacturing and Materials                      Human Health                      Research by Department                      Research Centers, Institutes and Facilities                      Commercialization                      Undergraduate Research                      International Collaborations                      Interdisciplinary Science and Engineering Building ISEB                      Industry                      Corporate Partners Program                      Annual Membership Levels                      Connect with Students                      Jobs/Internships                      EngiTECH                      Prototyping Services                      Sponsored Research                      Engineering Leadership Council                      External Relations Office                      Outreach                      K-12                      APPcamp                      ASPIRE                      Athena Olympiad                      CardioStart                      FABcamp                      Lab to Lesson Plan                      MESA                      St. Margaret’s Program                      Community College                      International                      International Opportunities                      Inclusion                      IDEA - Inclusion, Diversity, Equity, Access                      Office of Access and Inclusion                      News & Events                      Newsroom                      Archives                      Samueli Shoutouts                      Archives                      Media Watch                      Archives                      Video Archive                      Deans Report                      Facts & Figures                      Events                      Archives                      E-Newsletter                      2021                      2020                      2019                      2018                      2017                      2016                      Social Media                      Contact Us                      Style Guide                      Color Palette                      Wordmarks                      For Print                      For Web/Digital                      Dept Wordmarks                      For Web/Digital                      For Print                      PowerPoint          Weather in Irvine        | 66 °F STATUS: CAMPUS ACCESS LIMITED TO ESSENTIAL INDIVIDUALS ONLY.  STAY SAFE: Check Building Occupancy | Check Social Distancing Adherence Secondary MenuDepartment of Civil and Environmental EngineeringMessage From ChairMissionFacts & FiguresUndergraduateGraduateCareer OpportunitiesResearchFaculty & StaffAcademic EmploymentCEE AffiliatesAlumniDept EventsDept NewsE-NewsletterGive to CEEContact Us Contact InfoAddress:Department of Civil and Environmental Engineering E4130 Engineering Gateway BuildingIrvine, CA 92697-2175Phone:949 824-5333Email:cee@uci.edu Department of Civil and Environmental Engineering Chair’s Message. READ MOREKristen Davis left teaches students about hydrologic transport fundamentals in Newport Bay. READ MOREResearchers are studying factors that affect detection and variability of SARS-CoV-2 in wastewater. READ MORECEE faculty Farzad Naeim, Ayman Mosallam and Amir AghaKouchak are recognized with recent awards.COSMOS is a four-week program for talented high school students interested in STEM topics. LEARN MORETalented CEE students earn fellowships and scholarships. LEARN MORE Message From ChairHappy New Year and welcome to 2021! Last year was a consequential one, necessitating adaptation and growth in every aspect of society, including in the CEE department. Through it all, our students, faculty, staff and alumni have demonstrated their leadership, resilience and deep commitment to supporting the innovative education and cutting-edge research that are the hallmarks of our department. Making the health and safety of our entire community our highest priority, our dedicated faculty worked hard to completely transform our curriculum for online instruction. Students have responded with continued productivity, a testament to the rigors of a UC education. Last summer, as our nation turned its attention to the critical need to address racial injustice, CEE leadership, faculty, staff and students took a strong stand in supporting the Black Lives Matter movement. We work hard to ensure that our education and our research contribute to building a just and equitable society.Read more >> Research Focus Areas   Environment & Energy Structures Transportation Water Department News                      May 27, 2021        Two Henry Samueli School of Engineering Scientists Win DOE Early Career Awards                    May 17, 2021        Greenhouse Gas and Aerosol Emissions are Lengthening and Intensifying Droughts                    May 10, 2021        Dean’s Distinguished Lecture Series Welcomes Stephen Pacala                    April 30, 2021        Foufoula-Georgiou Contributes to U.S. Nuclear Waste Technical Review Board Report, Issued Today    View more News  Contact UsSamueli School of Engineering5200 Engineering HallIrvine, CA 92697-2700+1-949-824-4333 Undergraduate Student Affairs+1-949-824-4334ugengr@uci.edu Graduate and Professional Studies+1-949-824-8090gradengr@uci.eduDiscover SamueliAccessibilitySafety ProceduresEmploymentProspective StudentsUndergraduateGraduateCurrent StudentsUndergraduateGraduateGive to Samueli SchoolVisit the School2020 Dean’s ReportStyle GuideAnt-eaterTwitterFacebookYouTubeInstagramLinkedInMail©2021 Samueli School of EngineeringUniversity of California, IrvineAboutInterim Deans MessageStrategic PlanFacts and FiguresHenry SamueliSchool LeadershipEngineering Leadership CouncilAccreditationOrange CountyEmploymentFaculty PositionsView All Open PositionsApplication HelpLecturer PositionsPostdoctoral Scholar PositionsResearch PositionsOpen Samueli School of Engineering Staff PositionsVisit UsDriving DirectionsParking and MapsWalking MapUCI Campus MapsGot Questions?AdmissionsUndergraduateEnrollment and Degrees AwardedWhy UCI?Study AbroadSouthern California LocationExperiential LearningResearch OpportunitiesCampus LivingChemistry for EngineeringProgram in International Engineering PIEEntrepreneurial OpportunitiesStudent GroupsHow to ApplyDeadlinesFinancial AidAdmissions OfficeProspective StudentsUCI-IVC Engineering AcademyEngineering AmbassadorsNewly AdmittedFreshmenTransfersMajors and Minors OfferedFrequently Asked QuestionsContact UsGraduatePrograms and ConcentrationsHow to ApplyAccelerated Status ProgramInternational FellowshipsMeet Us on the RoadFrequently Asked QuestionsPhD and Masters Inquiry FormContact UsResearchEngineering Phase 3 Research RestartResearch Support / ERMEngineering Coronavirus SolutionsMessage from the Associate DeanResearch ThrustsAdvanced Manufacturing and MaterialsCommunications and Information TechnologyEnergy and SustainabilityHuman HealthResearch by DepartmentResearch Centers, Institutes and FacilitiesCommercializationUndergraduate ResearchInternational CollaborationsInterdisciplinary Science and Engineering Building ISEBIndustryCorporate Partners ProgramAnnual Membership LevelsConnect with StudentsJobs/InternshipsEngiTECHPrototyping ServicesSponsored ResearchEngineering Leadership CouncilExternal Relations OfficeOutreachK-12APPcampASPIREAthena OlympiadCardioStartFABcampLab to Lesson PlanMESASt. Margaret’s ProgramCommunity CollegeInternationalInternational OpportunitiesInclusionIDEA - Inclusion, Diversity, Equity, AccessOffice of Access and InclusionNews & EventsNewsroomArchivesSamueli ShoutoutsArchivesMedia WatchArchivesVideo ArchiveDeans ReportFacts & FiguresEventsArchivesE-Newsletter202120202019201820172016Social MediaContact UsStyle GuideColor PaletteWordmarksFor PrintFor Web/DigitalDept WordmarksFor PrintFor Web/DigitalPowerPoint Current StudentsUndergraduateAcademic Advising & SupportAcademic CounselingFaculty AdvisementEngineering MentorsComputing SupportAcademic Planning & ResourcesAcademic Opportunities & ResearchProgram in International Engineering PIEFinancial SupportMerit Based ScholarshipsOnline Forms & ResourcesCalendar & DeadlinesCareer ResourcesClubs and OrganizationsE-Week 2021Frequently Asked QuestionsContact UsGraduateAdvisors & CoordinatorsGraduate Studies CommitteeCurricular Practical TrainingDeadlinesSummer 2021Fall 2020Winter 2021Spring 2021New Graduate StudentsPh.D. MilestonesPolicies & ProceduresResourcesFinancial SupportCurrent FellowshipsInternal FellowshipsExternal FellowshipsNamed FellowshipsHenry Samueli Endowed FellowshipHolmes Endowed FellowshipStudent EmploymentTeaching Assistant FAQsZotChatContact UsAdditional ResourcesEngineering Student Study/Meeting SpaceFree SoftwareDepartmentsBiomedical EngineeringMessage From ChairAboutFacts & FiguresUndergraduateEducational MissionsBiomedical Engineering ProgramBiomedical Engineering: PremedicalBiomedical EngineeringBiomedical Engineering: PremedicalBiomedical Engineering MinorGraduateWhy Apply? Admission RequirementsDegree Requirements CoursesFrequently Asked QuestionsResearchBiomedical Computational TechnologiesBiomedical Nanoscale SystemsBiomolecular/Genetic EngineeringBiophotonicsCardiovascular EngineeringNeuroengineeringTissue EngineeringFaculty & StaffFacultyAffiliated FacultyBusiness Office StaffAcademic EmploymentCorporateDept EventsDept NewsDiscovery NewsPrintOnlineArchivesStudent TestimonialsGive to BMEContact UsChemical and Biomolecular EngineeringMessage From ChairAboutFacts & FiguresUndergraduateEducational MissionChemical EngineeringStudent GroupsGraduateWhy Apply?Frequently Asked QuestionsNSF Graduate Research FellowsResearchBiomolecular Engineering and Biotechnology Energy and SustainabilityMacromolecular EngineeringFaculty & StaffFacultyAffiliated FacultyEmeritus FacultyBusiness Office StaffAcademic EmploymentSeminar SeriesDept EventsDept NewsContact UsCivil and Environmental EngineeringMessage From ChairMissionFacts & FiguresUndergraduateEducational MissionsCivil EngineeringEnvironmental EngineeringCivil EngineeringEnvironmental EngineeringStudent GroupsStudent ProjectsStudent SupportInternshipsExternshipsScholarshipsGraduateEnvironmental & Energy SystemsInformation for Prospective StudentsHydrology and Water Resources SystemsStructures, Geotechnics and MaterialsTransportation SystemsAdmission RequirementsFinancial SupportHenry Samueli Endowed FellowshipMedhat Haroun Engineering Fellowship Career OpportunitiesCity of Costa Mesa Building Division Plan Check Engineer/Plan CheckerCity of Long Beach CA Combination Building Inspector Internship ProgramCity of Orange Community Development Plan Check EngineerCommunity Water Internship ProgramFull Time Position with Hobach-Lewin Structural EngineersGeotechnical Engineering Position with Calland Engineering, Inc.KNA Structural Engineers Job OpportunitiesCity of Los Angeles Public Water & Power New Engineering Associate Training ProgramCity of Los Angeles Public Water & Power Student Engineer ProgramEnvironmental Engineering of the Future E2F Student Jobs/InternshipsKimley-Horn Career OpportunitiesLPA, Inc. Internship & Entry Level Designer RolesWoodard & Curran Internship OpportunitiesCivil/Electrical Engineering Position, ProjectLineProject Engineer/DraftspersonTJW Engineering Internship OpportunityTrinity Consultants - Environmental EngineersResearchEnvironment & EnergyStructuresTransportationWaterFaculty & StaffOffice HoursFacultyAffiliated FacultyEmeritus FacultyBusiness Office StaffAcademic EmploymentCEE AffiliatesQuarterly MeetingsMembership BenefitsHow to JoinStudent SupportInternshipsExternshipsScholarshipsOC Report CardAlumniGet InvolvedDept EventsDept NewsE-NewsletterGive to CEEContact UsElectrical Engineering and Computer ScienceAboutMessage From ChairFacts & FiguresContact UsIndustry Advisory BoardAcademicsUndergraduateEducational MissionsComputer EngineeringElectrical EngineeringComputer Science and EngineeringElectrical EngineeringComputer EngineeringComputer Science and EngineeringGraduateElectrical EngineeringComputer EngineeringRoadmap to an M.S. DegreeRoadmap to a Ph.D. DegreePh.D. Preliminary Examination in CpE Ph.D. Preliminary Examination in EE-Circuits & DevicesPh.D. Preliminary Examination in EE-SystemsAdmissions: Frequently Asked QuestionsGeneral Application InformationDeadlinesGraduate Application InformationTranscriptsGRE ScoreTOEFL/IELTS Score Applies to international students onlyRequirementsFinancial Aid/FundingAdmitted Student Information Financial Aid for EECS Grad StudentsAdditional Program InformationStudent OrganizationsPeopleFacultyAffiliated FacultyEmeritus FacultyStaffResearchEE-CircuitsEE-SystemsCpEFormsNews & EventsNewsEventsMagazineSeminar Series                                                                                                              Academic EmploymentMaterials Science and EngineeringMessage From ChairAboutFacts & FiguresUndergraduateAlumniMSE MajorsMSE MinorsEducational MissionMaterials Science and EngineeringWhat is MSE?GraduateAlumniPh.D. AlumniM.S. AlumniCurrent StudentsNSF Graduate Research FellowsNASA NSTRF Graduate Research FellowsResearchAdvanced and Additive ManufacturingAdvanced Materials CharacterizationBiomaterials, Bioinspired and Self-Assembled MaterialsEnergy Materials and SustainabilityMaterials for Structural Applications and Extreme EnvironmentsModeling, Theory and Computational Approaches to Materials Science and EngineeringNanoscale and Functional MaterialsFaculty & StaffCore FacultyAffiliated FacultyBusiness Office StaffAcademic EmploymentMSE Business & FormsAcademic Personnel, Human Resources, PayrollResearch, Facilities, SafetyStudent Affairs, AdvisingAdministrative Operations, FacilitiesMSE EventsMSE 298 SeminarsMSE NewsMSE Diversity & InclusionMSE Anti-Racism Work GroupContact UsMechanical and Aerospace EngineeringMessage From ChairAboutHistory of Aerospace Engineering at UCIHonors and Awards - Major National DistinctionsHonors and Awards - International DistinctionsCorporate AffiliatesFacts & FiguresUndergraduateEducational MissionsAerospace Engineering ProgramMechanical Engineering ProgramAerospace EngineeringMechanical EngineeringEducational ExperienceCareers and SalariesGraduateMaster of Science Degree RequirementsPh.D. Degree RequirementsFrequently Asked QuestionsResearchDynamics and ControlsFluid Dynamics and PropulsionThermal and Transport SciencesMechanics of Materials and StructuresSystems and DesignFaculty & StaffFacultyAffiliated FacultyEmeritus FacultyFaculty appointments in Mechanical and Aerospace EngineeringBusiness Office StaffAcademic EmploymentE-NewsletterMAE SeminarsPrevious SeminarsIntranetContact UsDirectoryAll faculty & staffDeans OfficeDevelopment and External RelationsStudent AffairsEngineering Research ManagementUC Irvine DirectoryFaculty & StaffPersonnelAcademicReview Process FAQ’sStaffBenefitsCompensation & ClassificationEmploymentLeaves/DisabilityPersonnel PoliciesPerformance Management ResourcesJob Description JD – Creating a JDRecruitmentTraining and DevelopmentWellnessWorker’s CompensationFormsEngineering Research ManagementPre-AwardPre-Award Proposal RequestPre-Award Forms and Proposal TemplatesPost-AwardERM Post-Award AssignmentsPost-Award FormsEarly Career OpportunitiesContact UsPurchasing & ReimbursementPurchasing RequestsReimbursementsPurchasing & Reimbursement Mission StatementBusiness Meetings/ Entertainment GuidelinesFormsService AgreementsTravel GuidelinesUC Policies & ProceduresAdministrative StaffDeans OfficeChief Administrative OfficersPersonnel UnitFinance UnitPurchasing UnitComputing UnitFacilities UnitCurriculum, Analytical Studies, & Accreditation CASACommunications OfficeDevelopment and External Relations OfficeOutreach UnitEngineering Research ManagementComputing SupportHelpdeskOffice of Information TechnologyFaculty WebsitesComputer Labs & LaptopsFacilities SupportEngineering Facilities Request FormSafety ProcedureszotALERTCampus Evacuation ZonesZone CrewEnvironmental Health & SafetyUCI Police DepartmentHelpful LinksOrg ChartsAt Your ServiceZot! PortalFAQs for Engineering InstructorsSpring AwardsAlumni & FriendsAlumni SpotlightDonor NewsHall of FameNomination Form2020 Inductees2019 Inductees2018 Inductees2017 Inductees2015 Inductees#ANTEATERENGINEERWays to GiveBrilliant Future: Case for SupportJoin the Deans CircleMake a Gift OnlineUCI Engineering Alumni SocietyUC Irvine Alumni AssociationContact Us  "}, {"id": 8, "url": "https://www.engr.ucr.edu/covid-19-information-page", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentMarlan and Rosemary Bourns College of EngineeringBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringSearchUC Riverside Marlan and Rosemary Bourns College of Engineering Celebrating 30 YearsSearchStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership Departments and ProgramsBioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMasters in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership BioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMasters in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringBreadcrumbCOVID-19 Information PageCOVID-19 Information PageVIEW CAMPUS STATUSTo learn the latest on campus reopening efforts, visit the Campus Return website.QUESTIONS? Review the BCOE FAQ prior to contacting team members for assistance:BCOE COVID-19 FAQsDaily Wellness Check For UCR employees and students with UCRNetID For visitors without a UCRNetIDTO OBTAIN PPE & FACE COVERINGS: Learn moreIm searching for guidance on: Instruction ContinuitySpring 2021\tInstruction will be in online or remote formats for the entire quarter.UCR recommendations for instruction continuity: UCR Keep Teaching Website Zoom is the predominant method being suggested\tZoom Security and Best PracticesBCOE has requested Zoom Pro licenses for all BCOE Instructors, check your access at this link using your NetIDView a Zoom tutorial on creating assessments e.g., exams through iLearnWorkshop on course delivery via Zoom\t\tCampus-wide online discussion board for questions Faculty resources shared during BCOE Zoom meeting:Poll EverywhereGradescopeiClicker offering free access due to COVID-19  Academic PersonnelFor questions about purchasing, please contact your department/program purchasing assistant. They have the most current information on policies and procedures to ensure reimbursements are approved.VPAP Memo: Stop the Clock, and other items 3/20/2020 \tVPAP Walker Memo COVID-19 3 20 2020.pdf Research ContinuityView the latest on research ramp-up guidelines hereFollowing are requirements for all persons visiting campus: 1. Complete the COVID-19 Prevention TrainingTo complete the course, please proceed as follows:\tLog into RSpace http://www.rspace.ucr.eduUnder Authorized Applications use the link to the UC Learning Center LMS. This will take you to http://ucrlearning.ucr.edu, where you may also login directly.Click Login Now!On the homepage, click on the Required Training buttonClick the Start button to the left of the activity nameFor tips on eCourses, browser compatibility, and user guides, visit the UCR UC Learning Center support site. If you need assistance accessing the UC Learning Center, please email ucrlearning@ucr.edu. If you have questions about this, please email ehstraining@ucr.edu.2. Obtain permission see below either as a research group member for an approved research ramp-up proposal, or for a one-time visit.3. Check in and check out when entering and leaving campus rooms either by scanning the QR codes on the door, or by explicitly selecting room numbers at https://intra.engr.ucr.edu/apps/researchscheduler/user/checkin.phpTo submit a ramp-up proposal to resume on-campus research research PIs onlyhttps://ehs.ucr.edu/coronavirus/returnTo request a one-time permission to come to campusComplete the COVID-19 Prevention TrainingFill out and submit the form at https://forms.gle/74JfGo23bQ16br2S8Log all entries and exit via QR scanning or at https://intra.engr.ucr.edu/apps/researchscheduler/user/checkin.phpFor instructions click here Continually check the FAQ document for the latest updates on research activities.If you need PPE or face coverings, refer to the June 9 email from EH&S.Research ramp-up efforts will begin June 8 with researchers meeting special requirements as outlined by the Office of Research and Economic Development.Alert your Department LSO activities, equipment or materials requiring monitoring and the necessary frequency. During research ramp-up, safety protocols in a lab will remain in place. SOP for Working Alone in the LabFollow building security requirements in the BCOE Space Use Policy.Check campus COVID-19 information pages frequently. Create a contact sheet for your lab including contact information for the faculty member and a secondary contact. Share this information with your Chair and your LSO.Guidance for asymptomatic on-site personnel who do not have healthcare duties Posted April 6.Remote AccessAccessing VPNAccessing Remote DesktopTravelhttps://ehs.ucr.edu/coronavirus#information_for_travelersAdministrative Documents - Leave Access, Charging C&G, New Hire Guidance, etc.April 15: COVID-19 related leave and job protection guidance UCR Human Resources COVID-19 Information PageMarch 26: Charging C&G Costs to Federal Sponsored Awards During COVID-19March 20: New Hire GuidanceMarch 26: Leave Guidance for Supervisors of Academic Appointments - UPDATEMarch 19: Leave Guidance for Supervisors of Academic AppointmentsInformation TechnologyBourns EngineeringComputer ScienceSystems reminder: Confirm your computers are up to date with patches and virus/malware protectionBe aware of COVID-19 related computer viruses. Use caution when searching online and verify links are secure prior to clicking on them.\t\tLearn about fake online COVID-19 related information page.April 1 U.S. Secret Service message re: malicious emails  Library ServicesSee the Library information page for available services FacilitiesIf you are on campus and identify an emergency issue, please do the following: call 951-827-4677 AND also email facilities@ucr.edu. As of April 3, EH&S has indicated the following services are continuing but are subject to change at any time:Hazardous waste pick upProcessing of radiation ordersProcessing controlled substances orderIBC, IACUC, and RSC reviewsLaboratory evaluations of any kind will not be scheduled or conducted during this time.April 15: Facilities services that are continuing.  COVID-19 Info and Stats June 9 PPE and face coverings email from EH&SMay 30 research ramp-up notification by the Office of Research and Economic Development.May 9 updated Riverside County OrderApril 2 Order: Extension of school closures to June 19March 31 public health recommendation to cover the faceAmended March 13 Order on school closures by the Public Health Officer of the County of RiversideMarch 16 Order on gatherings by the Public Health Officer of the County of RiversideMarch 13 Order on school closures by the Public Health Officer of the County of Riversidehttps://ehs.ucr.edu/coronavirus/faq_faculty-staffUCOP COVID-19 webpageCDCCDC COVID-19 FAQs QUESTIONS? Review the BCOE FAQ prior to contacting team members for assistance:BCOE COVID-19 FAQsContactsWebsite Suggestions: Jay Farrell, farrell@ece.ucr.eduInstruction: Marko Princevac, marko@engr.ucr.eduResearch: Chinya Ravishankar, ravi@cs.ucr.eduBusiness Operations: Alissa Rackstraw, alissa@engr.ucr.eduInformation Technology: John Cleary, john@engr.ucr.edu, or Victor Hill, vhill@cs.ucr.eduSafety and Facilities: Perry Cheung for safety at pcheung@engr.ucr.edu or Todd Ambriz for facilities at tambriz@engr.ucr.eduSearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: 951 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRMarlan and Rosemary Bourns College of Engineering             446 Winston Chung Hall            900 University Ave.             Riverside, CA 92521              tel: 951 827-5190                 fax: 951 827-3188         email: news@engr.ucr.edu Related LinksBCOE Available Conference Rooms and Technology ResourcesGive to BournsIntranetFaculty ResourcesMarketing ResourcesSystemsFollow US:Visit BCOEs Facebook page external site: FacebookFollow BCOE on Twitter external site: TwitterVisit BCOEs YouTube channel external site: YouTubeVisit BCOEs Flickr gallery external site: FlickrSubscribe to BCOE News via RSS FeedPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel"}, {"id": 9, "url": "https://ehs.ucr.edu/coronavirus/return", "html": "Skip to main contentPlanning Budget & AdministrationReport a Incident, Injury or Safety ConcernReport a COVID-19 or Public Health ConcernSearchUC Riverside Environmental Health & Safety SearchAbout EH&SOrganizational ChartPrograms & PoliciesStaff DirectoryWho Do I Call?How Can We Help?Programs & PoliciesFood Permit RequestHazardous Waste Pick UpLog into Chemicals, INSPECT, LHAT, & WASTe AppsPersonal Protective Equipment PPEPrograms & ServicesTrainingCOVID-19 Prevention TrainingReportCOVID-19 ConcernSafety ConcernWork Related Injury/IllnessReport a Incident, Injury or Safety ConcernReport a COVID-19 or Public Health ConcernFace Coverings are required while on campus. Staff/Faculty may request a face covering from EH&S. Students may request a face covering from The Well.×BreadcrumbCoronavirusReopening WorkReturn to Campus protocols As always, your health and well-being are our primary concern. If you are able to do your job effectively without returning to campus, we urge you to talk with your supervisor about continuing to work remotely. As more people get vaccinated and the overall level of new COVID-19 cases declines across the country, we are easing out of the worst public health crisis in a generation. All returns to the workplace must be pre-approved. If you have any questions or concerns about this, please speak with your supervisor. The guidance below applies to all employees who perform duties on campus or UC leased or affiliated properties, unless the facility has expressly provided different instructions. Deans and unit heads will determine which groups are needed to work in person. For those who are approved to return, we are instituting new protocols designed to protect yourself and others. We expect all on-campus workers to abide by the guidelines and directives described below.SupervisorsAuthorization. Provide authorization for each employee to report onsite. Worksite specific plan. Must develop own Worksite Specific Plan . In some cases, the Worksite Specific Plan may be routed to campus oversight committees for review and approval prior to return to campus. Positive case? Refer to the COVID-19 Symptom monitoring and reporting procedures and Response to suspected COVID-19 cases: Guide for Department Leads, Supervisors, Chairs\". Download the quick reference for Supervisors Infographic.For All Returning EmployeesCOVID-19 Prevention Plan Campus GuidanceCOVID-19 Prevention PlanThe campus has developed general guidance, which all employees should review.Prior to your return, your supervisor must share their Worksite Specific Plan with all their employees, and you must review and acknowledge.Download the When To Return guidance infographic. You can also view the Return to Campus Working Group webinars on You Tube. TrainingCOVID-19 PREVENTIONAll employees who plan to be on-site are required to view a training video, \"COVID-19 prevention training\" as required by CDPH/CalOSHA before returning to campus.  Even if you will continue to work remotely, but may need to come to campus occasionally, you must complete this training. This course is accessible in the UC Learning Center. Training WellnessUCR COVID-19 DAILY WELLNESS CHECK SURVEYAll employees who work on-site at a UCR property owner or leased must complete a survey prior to reporting for work. If you have symptoms or concerns about exposure, contact your primary care physician and the Wellness Hotline 844 827-6827. For more information, refer to the COVID-19 Symptom monitoring and reporting procedures SOP.Daily wellness check  EMPLOYEE WELLNESS PROGRAMThe UCR Wellness Program focuses on promoting awareness and education, motivation for positive behavior changes, and influencing campus practices and policy to support a healthy environment.WellnessFACULTY STAFF ASSISTANCE PROGRAMComPsych will provide GuidanceResources® services whose benefits will provide UCR faculty, staff and their household family members confidential support, resources and information for personal and work-life issues, free of chargeFaculty Staff Assistance ProgramFace coveringIn compliance with the UC order and the California Department of Public Health all individuals on UC property are required to wear face coverings. EH&S is offering face coverings to all campus employees. Submit a request using the button below. Supervisors may request on behalf of their staff using the Face Covering Request form.Face Covering RequestHygiene Disinfectant and sanitizersOrder a disinfectant kit from Facilities services includes disinfectant, painter’s tape, shop towels, and other items.  Download the Disinfecting Infographic for an at a glace guide.  Disinfectant KiT Request HandwashingAll employees must practice good hygiene by frequently washing your hands with soap and water for 20 seconds or longer. When possible, use soap and water instead of hand sanitizer. Watch this short video on proper handwashing.Custodial A summary of COVID-19 Building Ventilation, Lab Sanitation, Disinfecting and Cleaning schedule as of July 10, 2020 view the schedule in the link below. Learn more at Facilities Services Campus Return Support Information view details on cleaning schedule.Guidance Document and ScheduleVentilationAll campus buildings that are open to the public during normal times are safe environments. Some of our buildings are much older and have some limitations. Our buildings are designed to provide sufficientair changes based on building activities. We are making a special effort to ensure that all buildings have current filter changes. The information below is how HVAC systems are maintained.Expanded Timeframe: To help with airflow, Facilities Services is expanding the length of time outside airflow will circulate throughout each building.Filtration Maintenance: Building filtration systems are well maintained and have the appropriate level of filters for each building.Air Flow: To accommodate efficient airflow in each building, the most advanced level of filtersare being used based on the building’s air filtration system capabilities.Building VentilationStrict adherence to the public health posters and other visual cues throughout campus and in buildings will reduce transmission risks. Ventilation systems will continue to operate as designed even thoughbuilding occupancy will be reduced. This will further reduce the risk of potential airborne transmission.  While each individual occupant of a campus building will want to make sure these guidelines arefollowed, including limited occupancy, it will be very important to ensure that all the other occupants in that building, at least on that same floor, coordinate to ensure the overall density and guidelines arebeing followed on a collective basis.Transmission Reduction EffortsAccording to the World Health Organization WHO and the Centers for Disease Control CDC, the COVID-19 virus appears to spread human-to-human through respiratory droplets coming from an infected person. Based on public health guidance, the key transmission reduction factors include:social distancing,limiting occupancy,practicing good personal hygiene, andutilizing face coveringsAs part of the public health guidance, Facilities Services will disinfect high-touch areas including elevators, door handles, common areas and restrooms. We have made disinfecting kits available to departments and hand sanitizing stations are located at the entrance of each building. A map locating sanitizing stations can be viewed by clicking here. HVAC ventilation FAQsResources and SOPsSignageThe campus has developed standard signage and postings for building entrances, exits, stairs, elevators and more. Download and post signage through your work areas.COVID-19 Campus SignaGEThe following posters are installed throughout campus:Keep yourself healthy Face covering requiredElevator 1 person maximumWait here footprintsDo not use this area is closedTo obtain additional signs complete the COVID-19 signage request.Standard Operating Procedures SOPGeneral Areas: Office SpaceGeneral Area/Office Space Disinfection SOPLaboratories\tLaboratory/Research Space Disinfection SOPFacilities\tDisinfection response plan SOPShared VehicleTo reduce the spread of COVID-19, avoid sharing UCR vehicles whenever possible. Employees may share vehicles only if approved in advance and in writing by a supervisor. Review this Shared Vehicle Guidance for details.Visitors & ContractorsWe recognize that visitors, contractors, vendors and other non-UCR personnel may need to come to campus.Contract employees working through third party employers must follow all campus protocols.Contract employees are required to continue following all Non-Pharmaceutical Interventions NPI, such as masking, physical distancing, hygiene, daily wellness checks until further noticeContract units must complete and submit a copy of their WSSP or provide their employer’s equivalent documentation to ehspublichealth@ucr.eduNon-UCR affiliated individuals coming to campus for essential work must abide by visitor guidelines. Non-UCR Affiliate information TravelEmployees who have travelled domestically or internationally, whether for personal or business purposes should refer to the following guidelines and restrictions regarding travel. Travel GuidelinesQuick LinksCampus ReturnHotlineUCR Daily Wellness Check SurveyHuman Resources COVID-19 ResourcesStudent Health ServicesCampus Emergency StatusKeep TeachingKeep LearningKeep WorkingKeep ResearchingCoronavirus ResourcesFace Covering RequestResearch Ramp UpSearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: 951 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRUniversity of California, Riverside             Environmental Health & Safety             900 University Ave.             Riverside, CA 92521              tel: 951 827-5528                 fax: 951 827-5122         email: ehs@ucr.edu  Find UsRelated LinksCoronavirus Resources & UpdatesCustomer Service Satisfaction Survey for EH&SEmergency ManagementFire & Life SafetyRisk & Safety Solutions Web Application Log InRisk ManagementUC Police DepartmentUC Risk & Safety TrainingPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel"}, {"id": 10, "url": "https://forms.gle/MuniHhmD3mvPLZH77", "html": "Request for short, one-time visit to BCOE facilitiesThis form is only for one-time requests to come to campus. To submit research ramp-up proposals, please go to https://forms.gle/jh7XKvEcuDpK7gyK7.* RequiredEmail *Your emailYour name *Your answerOn-campus presence requires you to complete the COVID-19 training at the UC Learning Center LMS. Have you completed this training? *YesNoWill you ensure that before coming to campus, you will complete the UCR Symptom Monitoring Survey at https://ucriverside.az1.qualtrics.com/jfe/form/SV_cZwHeZMQU2F6Tsx?  If you are requesting permission for an external visitor, they must complete the Symptom Monitoring Survey at https://ucriverside.az1.qualtrics.com/jfe/form/SV_00Lu8W4mqmIdsqx. *YesNoNextNever submit passwords through Google Forms.This content is neither created nor endorsed by Google. Report Abuse - Terms of Service - Privacy Policy Forms  "}, {"id": 11, "url": "https://ucriverside.az1.qualtrics.com/jfe/form/SV_cOB8gBU6OVulQax", "html": "Javascript is required to load this page."}]